JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
/*
 * chips/bk7258/wifi/bk7258_wifi_lower.c
 *
 * NuttX netdev_lowerhalf data/control plane for BK7258 Wi-Fi (STA MVP).
 *
 * Skeleton status: the ops tables and register/carrier plumbing are wired;
 * transmit/receive and the wireless_ops_s handlers return documented
 * errors until the Beken public API (bk_wifi_sta_*, bk_wifi_scan_*) and the
 * vendor MAC TX/RX entry points are connected by the integration branch.
 */

#include <nuttx/config.h>
#include <nuttx/kmalloc.h>
#include <nuttx/net/net.h>
#include <nuttx/net/netdev.h>
#include <nuttx/net/netdev_lowerhalf.h>
#include <nuttx/wireless/wireless.h>

/* getreg32 is a NuttX macro here (arm_internal.h), not a function; the
 * scan-done diagnostics read the NX MAC FSM registers directly. */
#include <arm_internal.h>
#include <bk7258_memorymap.h>

#include <errno.h>
#include <net/if_arp.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdatomic.h>

#include "lwip/pbuf.h"
#include "generated/lmac_bus_msg.h"
#include "rwnx_intf.h"
#include "bk_private/bk_wifi.h"
#include "common/bk_err.h"

#include "generated/lmac_wifi_adapter.h"

#include "bk7258_wifi_internal.h"
#include "bk7258_scan_diag.h"
/* up_udelay: the clktick sample needs a real interval between the two
 * reads, not two adjacent loads. */
#include <nuttx/arch.h>

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
#include <components/event.h>
#include <components/sensor.h>
#include <modules/wifi.h>
#include <modules/wifi_types.h>
#include "bk_phy_adapter.h"
#include "bk_rf_adapter.h"
#include <syslog.h>

/* bk_aon_rtc_driver_init()/bk_aon_rtc_get_current_tick() and AON_RTC_ID_1, from
 * the authority AON RTC module imported under chips/bk7258/aon_rtc/. */

#include <driver/aon_rtc.h>

/* ke_l2_packet_tx() and struct ke_sk_params, the supplicant-side entry. */

#include <wpa_compat/sk_intf.h>

/* Ethernet header layout for the EAPOL split in ethernetif_input().
 *
 * Spelled out locally instead of including "lwip/prot/ethernet.h": that header
 * pulls in lwip/prot/ieee.h, which declares ETHTYPE_* as enum members, while
 * NuttX's nuttx/net/ethernet.h:55-56 defines ETHTYPE_ARP and ETHTYPE_IP as
 * macros -- and that header is already in scope here through
 * nuttx/net/netdev.h.  The macros then expand inside the enum
 * ("ETHERTYPE_ARP = 0x0806u") and the whole enum fails to parse.  The vendored
 * glue can use the lwIP header only because it never includes NuttX net
 * headers.
 *
 * Reading the two ethertype bytes by hand also keeps the comparison in network
 * byte order, so no htons() and no <arpa/inet.h> are needed, and it does not
 * assume the payload is 2-byte aligned.  ETH_PAD_SIZE is 0 in this port, so the
 * 802.3 header is exactly dest[6] + src[6] + type[2].
 */

#define BK7258_ETH_HDR_LEN      14u
#define BK7258_ETH_SRC_OFFSET    6u
#define BK7258_ETH_TYPE_OFFSET  12u
#define BK7258_ETHTYPE_EAPOL    0x888eu
#endif

/* WPA2 passphrase length bounds (wifi_types.h:67 WIFI_PASSWORD_LEN == 64+1).
 * A passphrase is 8..63 characters, or exactly 64 hex digits for a raw PMK. */

#define BK7258_WIFI_PSK_MIN_LEN  8u

extern int bmsg_tx_sender(struct pbuf *p, uint32_t vif_idx);

/* os/os.h defines this as beken_thread_t *; beken_thread_t is void *. Keep
 * the declaration local so this NuttX lower-half does not import its broad
 * compatibility macro surface merely to obtain the SDK scan request token. */

extern void **rtos_get_current_thread(void);
extern uint32_t bk7258_wifi_pwd_ofdm_get_override(void);

/****************************************************************************
 * Private data
 ****************************************************************************/

static struct bk7258_wifi_s g_bk7258_wifi;
static atomic_int g_bk7258_wifi_init_state = ATOMIC_VAR_INIT(0);
static int g_bk7258_wifi_init_result;

enum bk7258_wifi_init_state_e
{
  BK7258_WIFI_INIT_NOT_STARTED = 0,
  BK7258_WIFI_INIT_INITIALIZING,
  BK7258_WIFI_INIT_READY,
  BK7258_WIFI_INIT_FAILED,
};

#define PRIV2LOWER(p) (&(p)->lower)

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
static bk_err_t bk7258_wifi_scan_done(void *arg, event_module_t module,
                                      int event_id, void *event_data);
static bk_err_t bk7258_wifi_sta_connected(void *arg, event_module_t module,
                                          int event_id, void *event_data);
static bk_err_t bk7258_wifi_sta_disconnected(void *arg, event_module_t module,
                                             int event_id, void *event_data);
#endif

void bk7258_wifi_lower_rx_submit(struct bk7258_wifi_s *priv,
                                 struct bk7258_vpkt *vpkt);

static int bk7258_wifi_rx_enqueue(struct bk7258_wifi_s *priv,
                                  struct iob_s *iob)
{
  irqstate_t flags;

  flags = enter_critical_section();
  iob->io_flink = NULL;
  if (priv->rx_tail != NULL)
    {
      priv->rx_tail->io_flink = iob;
    }
  else
    {
      priv->rx_head = iob;
    }

  priv->rx_tail = iob;
  leave_critical_section(flags);
  return 0;
}

/* Armino's connector callback for an Ethernet frame. The vendor pbuf is
 * copied into the NuttX queue and released only after the copy completes.
 *
 * EAPOL is split off before that copy, see the block below.
 */

void ethernetif_input(int iface, struct pbuf *p, uint8_t dst_idx)
{
  struct bk7258_vpkt *vpkt;
  struct pbuf *q;
  uint8_t *dst;
  (void)iface;
  (void)dst_idx;

  if (p == NULL || p->tot_len == 0 || p->tot_len > BK7258_WIFI_FRAME_MAX)
    {
      if (p != NULL)
        {
          pbuf_free(p);
        }
      return;
    }

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  /* Hand EAPOL to wpa_supplicant instead of to the NuttX stack.
   *
   * Transcribed from the vendor's own bridge, ethernetif_input() in
   * cp/components/lwip_intf_v2_1/lwip-2.1.2/port/wlanif.c:331 -- there the
   * EAPOL test is likewise the first thing done to a frame, ahead of the netif
   * lookup, with this comment: "EAPOL must reach wpa_supplicant even when lwip
   * netif is not registered yet".
   *
   * Why it has to be here: the 4-way handshake is carried in 802.3 frames with
   * ethertype 0x888E, and every 802.3 frame arrives through this one function
   * (rwnx_rx.c:728, the tail of rwm_upload_data(), which is registered as
   * g_rwnx_connector.data_outbound_func in rw_ieee80211.c).  Without this
   * split, M1 was copied into the NuttX RX queue, where the network stack has
   * no consumer for 0x888E and drops it: wpa_supplicant reached ASSOCIATED,
   * armed its 10 s auth timeout, never saw M1, and the AP disassociated us
   * with reason 15 (4WAY_HANDSHAKE_TIMEOUT) about four seconds later.  Board-
   * verified three times per run in the sta-hwioctlfix image.
   *
   * Management frames were never affected, which is why auth/assoc/beacon all
   * worked: those take the separate rwnx_rx_mgmt_any() path.
   *
   * This gap was known and recorded, not newly discovered:
   * hal_port/include/wpa_compat/sk_intf.h:20-22 states that "EAPOL/WAI (0x888e)
   * demux to the WPA entity is the network bridge's job (plan 11.4.2), not this
   * header's" -- the bridge is this function, and the work was never done.
   *
   * The self-echo filter is the vendor's too: our own transmitted EAPOL can be
   * looped back by the MAC, and feeding it to the supplicant would corrupt the
   * handshake state machine.  Frames whose source is our own address are
   * dropped rather than forwarded.
   *
   * Runtime-gated because ke_l2_packet_tx() lives in sk_intf.c, which is only
   * compiled under CONFIG_BK7258_WIFI_VENDOR_RUNTIME (CMakeLists.txt:158); the
   * runtime-disabled CP image must not reference it.
   */

