JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  if (p->len > BK7258_ETH_HDR_LEN)
    {
      FAR const uint8_t *eth = (FAR const uint8_t *)p->payload;
      uint16_t ethtype = ((uint16_t)eth[BK7258_ETH_TYPE_OFFSET] << 8) |
                          (uint16_t)eth[BK7258_ETH_TYPE_OFFSET + 1u];

      if (ethtype == BK7258_ETHTYPE_EAPOL)
        {
          struct ke_sk_params params;
          uint8_t own_mac[6];

          /* The vendor bridge compares the frame's source against the vif's
           * in-RAM MAC (wlanif.c: wifi_netif_vif_to_mac(vif)).  Our equivalent
           * is the vendor's own accessor: it resolves to bk_get_mac(), which
           * caches the address in RAM after one flash read at first use
           * (hal_port_mac.c:126-137) -- so this stays cheap on the RX path.
           * bk7258_wifi_board_get_mac() was rejected for exactly that reason:
           * it re-reads the flash partition on every call, here inside the
           * core thread during the 4-way window. */

          if (bk_wifi_sta_get_mac(own_mac) == BK_OK &&
              memcmp(own_mac, eth + BK7258_ETH_SRC_OFFSET,
                     sizeof(own_mac)) == 0)
            {
              pbuf_free(p);
              return;
            }

          /* buf/len describe the whole 802.3 frame, header included, exactly
           * as the vendor bridge passes it. */

          params.buf  = (unsigned char *)p->payload;
          params.len  = p->len;
          params.flag = iface;
          params.freq = 0;

          ke_l2_packet_tx(&params);
          pbuf_free(p);
          return;
        }
    }
#endif /* CONFIG_BK7258_WIFI_VENDOR_RUNTIME */

  vpkt = bk7258_vpkt_alloc(p->tot_len, true);
  if (vpkt == NULL)
    {
      pbuf_free(p);
      return;
    }

  dst = vpkt->payload;
  for (q = p; q != NULL; q = q->next)
    {
      memcpy(dst, q->payload, q->len);
      dst += q->len;
    }
  bk7258_wifi_lower_rx_submit(&g_bk7258_wifi, vpkt);
  pbuf_free(p);
}

/****************************************************************************
 * Data plane
 *
 * transmit/receive stay disconnected until the vendor MAC TX/RX entry points
 * are wired. Returning -ENOSYS from transmit makes the upper half recycle the
 * NetPKT; returning NULL from receive signals "no packet available".
 ****************************************************************************/

static int bk7258_wifi_ifup(FAR struct netdev_lowerhalf_s *lower)
{
  FAR struct bk7258_wifi_s *priv =
    (FAR struct bk7258_wifi_s *)lower;

  /* Administrative up only.  Carrier is owned by the association events
   * (bk7258_wifi_sta_connected/disconnected) and must not be touched here: an
   * interface is legitimately brought up before associating, and clearing the
   * flag on ifup would desync this mirror from the IFF_RUNNING bit that
   * netdev_carrier_on/off actually own -- including the case where ifconfig up
   * follows a successful connect. */

  (void)priv;
  return OK;
}

static int bk7258_wifi_ifdown(FAR struct netdev_lowerhalf_s *lower)
{
  FAR struct bk7258_wifi_s *priv =
    (FAR struct bk7258_wifi_s *)lower;

  /* Administrative down only; carrier is owned by the association events for
   * the same reason as in ifup above.  Taking the interface down does not
   * disassociate, so the link -- and therefore the carrier -- outlives it. */

  (void)priv;
  return OK;
}

/* Hand a filled vendor pbuf to the vendor TX queue and release our reference.
 *
 * Split out so the netdev data path and the bring-up TX probe share the one
 * piece with non-obvious semantics: bmsg_tx_sender() takes its own reference
 * and drops it again if the queue push fails, so the reference from
 * pbuf_alloc() is ours to release on every path.  The two callers differ only
 * in where the bytes come from, which is why the allocation stays with them.
 */

static int bk7258_wifi_tx_pbuf(FAR struct bk7258_wifi_s *priv,
                               struct pbuf *p)
{
  int ret = bmsg_tx_sender(p, priv->vif_idx);

  pbuf_free(p);

  if (ret != BK_OK)
    {
      /* The low-heap early return in bmsg_tx_sender() is the one case that is
       * not a transport failure, and the upper half retries on -ENOMEM. */

      return ret == BK_ERR_NO_MEM ? -ENOMEM : -EIO;
    }

  return OK;
}

static int bk7258_wifi_transmit(FAR struct netdev_lowerhalf_s *lower,
                                FAR netpkt_t *pkt)
{
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  struct pbuf *p;
  unsigned int len;
  int ret;

  len = netpkt_getdatalen(lower, pkt);
  if (len == 0 || len > BK7258_WIFI_FRAME_MAX)
    {
      return -EMSGSIZE;
    }

  p = pbuf_alloc(PBUF_RAW_TX, (u16_t)len, PBUF_RAM);
  if (p == NULL)
    {
      return -ENOMEM;
    }

  ret = netpkt_copyout(lower, p->payload, pkt, len, 0);
  if (ret < 0)
    {
      pbuf_free(p);
      return ret;
    }

  ret = bk7258_wifi_tx_pbuf(priv, p);
  if (ret < 0)
    {
      return ret;
    }

  netpkt_free(lower, pkt, NETPKT_TX);
  netdev_lower_txdone(lower);
  return OK;
}

static FAR netpkt_t *bk7258_wifi_receive(FAR struct netdev_lowerhalf_s *lower)
{
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  FAR struct iob_s *iob;
  irqstate_t flags = enter_critical_section();

  iob = priv->rx_head;
  if (iob != NULL)
    {
      priv->rx_head = iob->io_flink;
      if (priv->rx_head == NULL)
        {
          priv->rx_tail = NULL;
        }
      iob->io_flink = NULL;
    }

  leave_critical_section(flags);
  return iob;
}

static void bk7258_wifi_reclaim(FAR struct netdev_lowerhalf_s *lower)
{
  /* Genuinely nothing to reclaim, rather than a stub.
   *
   * netdev_upper_can_tx() (netdev_upperhalf.c:248-256) calls this when the TX
   * quota has run out, giving a driver the chance to walk its hardware
   * descriptors and release the netpkts it still owns.  This driver never owns
   * one past the transmit call: bk7258_wifi_transmit() copies the payload into a
   * vendor pbuf, hands that to bmsg_tx_sender(), and frees the netpkt before
   * returning, so quota is returned on the same call stack that consumed it.
   *
   * Kept in netdev_ops_s regardless.  Without it can_tx() has no recovery path
   * at all, and quota loss would then be permanently fatal instead of merely
   * costing one poll cycle. */
}

/****************************************************************************
 * Control plane
 *
 * WAPI/WEXT STA handlers.  The standard ioctl sequence is:
 *   wapi mode  -> SIOCSIWMODE   -> ops->mode
 *   wapi psk   -> SIOCSIWAUTH x2 -> ops->auth  (WPA version, cipher)
 *              -> SIOCSIWENCODEEXT -> ops->passwd
 *   wapi essid -> SIOCSIWESSID ON -> ops->essid then ops->connect
 *   wapi scan  -> SIOCSIWSCAN   -> ops->scan   (existing, unchanged)
 ****************************************************************************/

static int bk7258_wifi_connect(FAR struct netdev_lowerhalf_s *lower)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;

  if (!bk7258_wifi_is_ready())
    {
      return -ENODEV;
    }

  if (priv->sta_mode != IW_MODE_INFRA)
    {
      return -EOPNOTSUPP;
    }

  if (priv->sta_ssid_len == 0u)
    {
      return -EINVAL;
    }

  /* Auth combination must be internally consistent before reaching the
   * vendor.  Open = WPA disabled + no PSK.  WPA2-PSK = WPA2 + CCMP +
   * PSK present.  Anything else is a caller error. */

  if (priv->auth_wpa == IW_AUTH_WPA_VERSION_DISABLED)
    {
      if (priv->sta_psk_len != 0u)
        {
          return -EINVAL;
        }
    }
  else if (priv->auth_wpa == IW_AUTH_WPA_VERSION_WPA2)
    {
      if (priv->auth_cipher != IW_AUTH_CIPHER_CCMP ||
          priv->sta_psk_len < BK7258_WIFI_PSK_MIN_LEN)
        {
          return -EINVAL;
        }
    }
  else
    {
      return -EOPNOTSUPP;
    }

