JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  syslog(LOG_INFO, "[BK7258-WIFI] wapi connect: ssid=\"%s\" psk_len=%u\n",
         priv->sta_ssid, (unsigned)priv->sta_psk_len);

  return bk7258_wifi_sta_connect(priv->sta_ssid, priv->sta_psk);
#else
  (void)lower;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_disconnect(FAR struct netdev_lowerhalf_s *lower)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  bk_err_t ret;

  (void)lower;

  if (!bk7258_wifi_is_ready())
    {
      return -ENODEV;
    }

  ret = bk_wifi_sta_disconnect();
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] wapi disconnect failed=%d\n", (int)ret);
      return -EIO;
    }

  return OK;
#else
  (void)lower;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_essid(FAR struct netdev_lowerhalf_s *lower,
                             FAR struct iwreq *iwr, bool set)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  FAR char *dst;
  FAR uint8_t *dst_len;
  size_t len;

  if (iwr == NULL)
    {
      return -EINVAL;
    }

  if (!set)
    {
      /* Return the connection SSID if one is recorded, otherwise the
       * directed-scan SSID.  Both are NuttX-owned copies. */

      dst = priv->sta_ssid_len > 0u ? priv->sta_ssid : priv->scan_ssid;
      len = priv->sta_ssid_len > 0u ? priv->sta_ssid_len :
                                      priv->scan_ssid_len;
      if (iwr->u.essid.pointer == NULL || iwr->u.essid.length < len)
        {
          return -EINVAL;
        }

      memcpy(iwr->u.essid.pointer, dst, len);
      iwr->u.essid.length = (uint16_t)len;
      iwr->u.essid.flags = len > 0u ? 1u : 0u;
      return OK;
    }

  /* The upper-half routes IW_ESSID_ON here then calls connect(); it routes
   * IW_ESSID_DELAY_ON here without connecting (directed-scan selection).
   * IW_ESSID_OFF never reaches this handler -- the upper-half calls
   * disconnect() directly. */

  if (iwr->u.essid.pointer == NULL)
    {
      return -EINVAL;
    }

  /* ON records the connection SSID; DELAY_ON records the scan SSID. */

  if (iwr->u.essid.flags == IW_ESSID_ON)
    {
      dst = priv->sta_ssid;
      dst_len = &priv->sta_ssid_len;
    }
  else
    {
      dst = priv->scan_ssid;
      dst_len = &priv->scan_ssid_len;
    }

  len = iwr->u.essid.length;

  /* Some WEXT callers include the terminator in length; drop it. */

  if (len > 0u && ((FAR const char *)iwr->u.essid.pointer)[len - 1u] == '\0')
    {
      len--;
    }

  if (len > BK7258_WIFI_SCAN_SSID_LEN)
    {
      return -EINVAL;
    }

  memcpy(dst, iwr->u.essid.pointer, len);
  dst[len] = '\0';
  *dst_len = (uint8_t)len;
  return OK;
#else
  return -ENOSYS;
#endif
}

static int bk7258_wifi_bssid(FAR struct netdev_lowerhalf_s *lower,
                             FAR struct iwreq *iwr, bool set)
{
  return -ENOSYS;
}

static int bk7258_wifi_passwd(FAR struct netdev_lowerhalf_s *lower,
                              FAR struct iwreq *iwr, bool set)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  FAR struct iw_encode_ext *ext;

  if (iwr == NULL || iwr->u.encoding.pointer == NULL)
    {
      return -EINVAL;
    }

  ext = (FAR struct iw_encode_ext *)iwr->u.encoding.pointer;

  if (!set)
    {
      /* Report whether a key is configured and its algorithm, never the
       * key bytes themselves. */

      ext->alg = priv->sta_psk_len > 0u ? IW_ENCODE_ALG_CCMP :
                                          IW_ENCODE_ALG_NONE;
      ext->key_len = 0;
      return OK;
    }

  switch (ext->alg)
    {
      case IW_ENCODE_ALG_NONE:
        memset(priv->sta_psk, 0, sizeof(priv->sta_psk));
        priv->sta_psk_len = 0;
        return OK;

      case IW_ENCODE_ALG_CCMP:
        break;

      default:
        return -EOPNOTSUPP;
    }

  if (ext->key_len < BK7258_WIFI_PSK_MIN_LEN ||
      ext->key_len >= sizeof(priv->sta_psk))
    {
      return -EINVAL;
    }

  memcpy(priv->sta_psk, ext->key, ext->key_len);
  priv->sta_psk[ext->key_len] = '\0';
  priv->sta_psk_len = (uint8_t)ext->key_len;
  return OK;
#else
  (void)lower;
  (void)iwr;
  (void)set;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_mode(FAR struct netdev_lowerhalf_s *lower,
                            FAR struct iwreq *iwr, bool set)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;

  if (iwr == NULL)
    {
      return -EINVAL;
    }

  if (!set)
    {
      iwr->u.mode = priv->sta_mode;
      return OK;
    }

  if (iwr->u.mode != IW_MODE_INFRA)
    {
      return -EOPNOTSUPP;
    }

  priv->sta_mode = IW_MODE_INFRA;
  return OK;
#else
  (void)lower;
  (void)iwr;
  (void)set;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_auth(FAR struct netdev_lowerhalf_s *lower,
                            FAR struct iwreq *iwr, bool set)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  int idx;

  if (iwr == NULL)
    {
      return -EINVAL;
    }

  idx = iwr->u.param.flags & IW_AUTH_INDEX;

  if (!set)
    {
      switch (idx)
        {
          case IW_AUTH_WPA_VERSION:
            iwr->u.param.value = (int32_t)priv->auth_wpa;
            return OK;
          case IW_AUTH_CIPHER_PAIRWISE:
            iwr->u.param.value = (int32_t)priv->auth_cipher;
            return OK;
          default:
            return -EOPNOTSUPP;
        }
    }

  switch (idx)
    {
      case IW_AUTH_WPA_VERSION:
        if (iwr->u.param.value != IW_AUTH_WPA_VERSION_DISABLED &&
            iwr->u.param.value != IW_AUTH_WPA_VERSION_WPA2)
          {
            return -EOPNOTSUPP;
          }
        priv->auth_wpa = (uint32_t)iwr->u.param.value;
        return OK;

      case IW_AUTH_CIPHER_PAIRWISE:
        if (iwr->u.param.value != IW_AUTH_CIPHER_NONE &&
            iwr->u.param.value != IW_AUTH_CIPHER_CCMP)
          {
            return -EOPNOTSUPP;
          }
        priv->auth_cipher = (uint32_t)iwr->u.param.value;
        return OK;

      default:
        return -EOPNOTSUPP;
    }
#else
  (void)lower;
  (void)iwr;
  (void)set;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_country(FAR struct netdev_lowerhalf_s *lower,
                               FAR struct iwreq *iwr, bool set)
{
  return -ENOSYS;
}

