JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
static int bk7258_wifi_scan(FAR struct netdev_lowerhalf_s *lower,
                            FAR struct iwreq *iwr, bool set)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  FAR struct bk7258_wifi_s *priv = (FAR struct bk7258_wifi_s *)lower;
  size_t required = 0;
  size_t ssid_len;
  uint8_t index;
  int ret;

  if (!priv->scan_lock_ready)
    {
      return -ENODEV;
    }

  if (set)
    {
      nxmutex_lock(&priv->scan_lock);
      if (priv->scan_in_progress)
        {
          nxmutex_unlock(&priv->scan_lock);
          return -EBUSY;
        }

      /* bk_wifi_scan_start() records this exact caller token in its scan
       * request, then returns it in wifi_event_scan_done_t.scan_id. */

      priv->scan_id = (uint32_t)(uintptr_t)rtos_get_current_thread();
      priv->scan_in_progress = true;
      priv->scan_complete = false;
      priv->scan_status = -EAGAIN;
      priv->scan_count = 0;
      nxmutex_unlock(&priv->scan_lock);

      bk7258_scan_diag_begin();

      /* Directed vs broadcast scan.  The authority reference run was a
       * DIRECTED scan (`scanu_start_req ... ssid_len=3`) while ours has always
       * been broadcast (`ssid_len=0`); aligning that removes one difference
       * from the comparison.  Config built exactly like the vendor's own
       * callers do (zeroed struct, ssid copied, everything else left 0). */

      if (priv->scan_ssid_len > 0u)
        {
          wifi_scan_config_t cfg;

          memset(&cfg, 0, sizeof(cfg));
          memcpy(cfg.ssid, priv->scan_ssid, priv->scan_ssid_len);
          syslog(LOG_INFO, "[BK7258-WIFI] scan: directed len=%u\n",
                 (unsigned)priv->scan_ssid_len);
          ret = bk_wifi_scan_start(&cfg);
        }
      else
        {
          ret = bk_wifi_scan_start(NULL);
        }

      if (ret != BK_OK)
        {
          bk7258_scan_diag_record(BK7258_SCAN_DIAG_START_REJECTED);
          nxmutex_lock(&priv->scan_lock);
          priv->scan_in_progress = false;
          priv->scan_complete = true;
          priv->scan_status = ret == BK_ERR_BUSY ? -EBUSY : -EIO;
          nxmutex_unlock(&priv->scan_lock);
          return priv->scan_status;
        }

      bk7258_scan_diag_record(BK7258_SCAN_DIAG_START_ACCEPTED);

      return OK;
    }

  if (iwr == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->scan_lock);
  if (priv->scan_in_progress)
    {
      nxmutex_unlock(&priv->scan_lock);
      return -EAGAIN;
    }

  if (!priv->scan_complete)
    {
      nxmutex_unlock(&priv->scan_lock);
      return -EINVAL;
    }

  if (priv->scan_status < 0)
    {
      ret = priv->scan_status;
      nxmutex_unlock(&priv->scan_lock);
      return ret;
    }

  /* Calculate the full WEXT event stream before writing user storage. This
   * avoids returning partial results or exposing an incomplete AP record. */

  for (index = 0; index < priv->scan_count; index++)
    {
      ssid_len = strnlen(priv->scan_aps[index].ssid,
                         BK7258_WIFI_SCAN_SSID_LEN);
      required += IW_EV_LEN(ap_addr) + IW_EV_LEN(qual) + IW_EV_LEN(freq) +
                  IW_EV_LEN(data) + IW_EV_LEN(essid) +
                  ((ssid_len + 3u) & ~3u);
    }

  if (required > UINT16_MAX || iwr->u.data.pointer == NULL ||
      required > iwr->u.data.length)
    {
      iwr->u.data.length = required > UINT16_MAX ? UINT16_MAX : required;
      nxmutex_unlock(&priv->scan_lock);
      return -E2BIG;
    }

  {
    FAR uint8_t *cursor = iwr->u.data.pointer;

    for (index = 0; index < priv->scan_count; index++)
      {
        FAR struct iw_event *iwe = (FAR struct iw_event *)cursor;
        FAR struct bk7258_wifi_scan_ap_s *ap = &priv->scan_aps[index];
        iwe->cmd = SIOCGIWAP;
        iwe->u.ap_addr.sa_family = ARPHRD_ETHER;
        memcpy(iwe->u.ap_addr.sa_data, ap->bssid, sizeof(ap->bssid));
        iwe->len = IW_EV_LEN(ap_addr);
        cursor += iwe->len;

        ssid_len = strnlen(ap->ssid, BK7258_WIFI_SCAN_SSID_LEN);
        iwe = (FAR struct iw_event *)cursor;
        iwe->cmd = SIOCGIWESSID;
        iwe->u.essid.flags = 0;
        iwe->u.essid.length = ssid_len;
        iwe->u.essid.pointer = (FAR void *)sizeof(iwe->u.essid);
        memcpy(&iwe->u.essid + 1, ap->ssid, ssid_len);
        iwe->len = IW_EV_LEN(essid) + ((ssid_len + 3u) & ~3u);
        cursor += iwe->len;

        iwe = (FAR struct iw_event *)cursor;
        iwe->cmd = IWEVQUAL;
        iwe->u.qual.qual = 0;
        iwe->u.qual.level = (uint8_t)ap->rssi;
        iwe->u.qual.noise = 0;
        iwe->u.qual.updated = IW_QUAL_LEVEL_UPDATED | IW_QUAL_DBM |
                              IW_QUAL_QUAL_INVALID | IW_QUAL_NOISE_INVALID;
        iwe->len = IW_EV_LEN(qual);
        cursor += iwe->len;

        iwe = (FAR struct iw_event *)cursor;
        iwe->cmd = SIOCGIWFREQ;
        /* WEXT represents values 0..1000 as a channel number. This avoids
         * inventing a frequency conversion for a future/non-2.4GHz result. */
        iwe->u.freq.e = 0;
        iwe->u.freq.m = ap->channel;
        iwe->len = IW_EV_LEN(freq);
        cursor += iwe->len;

        iwe = (FAR struct iw_event *)cursor;
        iwe->cmd = SIOCGIWENCODE;
        iwe->u.data.flags = ap->security == WIFI_SECURITY_NONE ?
                            IW_ENCODE_DISABLED :
                            IW_ENCODE_ENABLED | IW_ENCODE_NOKEY;
        iwe->u.data.length = 0;
        iwe->u.data.pointer = NULL;
        iwe->len = IW_EV_LEN(data);
        cursor += iwe->len;
      }

    iwr->u.data.length = cursor - (FAR uint8_t *)iwr->u.data.pointer;
  }

  nxmutex_unlock(&priv->scan_lock);
  return OK;
#else
  (void)lower;
  (void)iwr;
  (void)set;
  return -ENOSYS;
#endif
}

static int bk7258_wifi_range(FAR struct netdev_lowerhalf_s *lower,
                             FAR struct iwreq *iwr)
{
  return -ENOSYS;
}

/****************************************************************************
 * Ops tables
 ****************************************************************************/

static const struct netdev_ops_s g_bk7258_net_ops =
{
  .ifup     = bk7258_wifi_ifup,
  .ifdown   = bk7258_wifi_ifdown,
  .transmit = bk7258_wifi_transmit,
  .receive  = bk7258_wifi_receive,
  .reclaim  = bk7258_wifi_reclaim,
};

