JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
static const struct wireless_ops_s g_bk7258_iw_ops =
{
  .connect    = bk7258_wifi_connect,
  .disconnect = bk7258_wifi_disconnect,
  .essid      = bk7258_wifi_essid,
  .bssid      = bk7258_wifi_bssid,
  .passwd     = bk7258_wifi_passwd,
  .mode       = bk7258_wifi_mode,
  .auth       = bk7258_wifi_auth,
  .country    = bk7258_wifi_country,
  .scan       = bk7258_wifi_scan,
  .range      = bk7258_wifi_range,
};

/****************************************************************************
 * Lifecycle / registration
 ****************************************************************************/

int bk7258_wifi_lower_init(struct bk7258_wifi_s *priv)
{
  memset(priv, 0, sizeof(*priv));

  priv->sta_mode = IW_MODE_INFRA;

  if (nxmutex_init(&priv->scan_lock) < 0)
    {
      return -ENOMEM;
    }

  priv->scan_lock_ready = true;

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  {
    bk_err_t ret = bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                                        bk7258_wifi_scan_done, priv);

    if (ret != BK_OK && ret != BK_ERR_EVENT_CB_EXIST)
      {
        nxmutex_destroy(&priv->scan_lock);
        priv->scan_lock_ready = false;
        return -EIO;
      }

    priv->scan_callback_registered = true;

    /* Association and disconnection drive the carrier flag; see the comment
     * above bk7258_wifi_sta_connected() for why carrier is dynamic here while
     * the authority keeps NETIF_FLAG_LINK_UP constant.
     *
     * Treated as fatal for the same reason the scan callback above is: if the
     * event module cannot take a callback, nothing about this driver works, and
     * a netdev whose carrier can never rise would accept an ifconfig and then
     * silently refuse to carry traffic. */

    ret = bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_STA_CONNECTED,
                               bk7258_wifi_sta_connected, priv);
    if (ret == BK_OK || ret == BK_ERR_EVENT_CB_EXIST)
      {
        ret = bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
                                   bk7258_wifi_sta_disconnected, priv);
        if (ret != BK_OK && ret != BK_ERR_EVENT_CB_EXIST)
          {
            (void)bk_event_unregister_cb(EVENT_MOD_WIFI,
                                         EVENT_WIFI_STA_CONNECTED,
                                         bk7258_wifi_sta_connected);
          }
      }

    if (ret != BK_OK && ret != BK_ERR_EVENT_CB_EXIST)
      {
        (void)bk_event_unregister_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                                     bk7258_wifi_scan_done);
        priv->scan_callback_registered = false;
        nxmutex_destroy(&priv->scan_lock);
        priv->scan_lock_ready = false;
        return -EIO;
      }

    priv->sta_event_registered = true;
  }
#endif

  return 0;
}

int bk7258_wifi_lower_uninit(struct bk7258_wifi_s *priv)
{
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  if (priv->scan_callback_registered)
    {
      (void)bk_event_unregister_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                                   bk7258_wifi_scan_done);
      priv->scan_callback_registered = false;
    }

  if (priv->sta_event_registered)
    {
      (void)bk_event_unregister_cb(EVENT_MOD_WIFI, EVENT_WIFI_STA_CONNECTED,
                                   bk7258_wifi_sta_connected);
      (void)bk_event_unregister_cb(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
                                   bk7258_wifi_sta_disconnected);
      priv->sta_event_registered = false;
    }
#endif

  if (priv->registered)
    {
      netdev_lower_unregister(PRIV2LOWER(priv));
      priv->registered = false;
    }

  while (priv->rx_head != NULL)
    {
      FAR struct iob_s *iob = bk7258_wifi_receive(PRIV2LOWER(priv));
      if (iob != NULL)
        {
          iob_free_chain(iob);
        }
    }

  if (priv->scan_lock_ready)
    {
      nxmutex_destroy(&priv->scan_lock);
      priv->scan_lock_ready = false;
    }

  return 0;
}

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
static bk_err_t bk7258_wifi_scan_done(void *arg, event_module_t module,
                                      int event_id, void *event_data)
{
  FAR struct bk7258_wifi_s *priv = arg;
  FAR wifi_event_scan_done_t *done = event_data;
  wifi_scan_result_t result = {0};
  int ret;
  int ap_num;
  int index;
  struct bk7258_scan_diag_s diag;

  if (priv == NULL || module != EVENT_MOD_WIFI ||
      event_id != EVENT_WIFI_SCAN_DONE || done == NULL ||
      !priv->scan_lock_ready)
    {
      return BK_OK;
    }

  nxmutex_lock(&priv->scan_lock);
  if (!priv->scan_in_progress || done->scan_id != priv->scan_id)
    {
      nxmutex_unlock(&priv->scan_lock);
      return BK_OK;
    }
  nxmutex_unlock(&priv->scan_lock);

  bk7258_scan_diag_record(BK7258_SCAN_DIAG_COMPLETION_CALLBACK);

  /* The SDK allocates result.aps. Copy the bounded data below, then release
   * it unconditionally before this synchronous event callback returns. */

  ret = bk_wifi_scan_get_result(&result);
  if (ret != BK_OK)
    {
      bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_FETCH_FAIL);
    }

  nxmutex_lock(&priv->scan_lock);
  if (priv->scan_in_progress && done->scan_id == priv->scan_id)
    {
      priv->scan_count = 0;
      priv->scan_status = ret == BK_OK ? OK : -EIO;

      if (ret == BK_OK && result.ap_num > 0 && result.aps != NULL)
        {
          ap_num = result.ap_num;
          if (ap_num > BK7258_WIFI_SCAN_MAX_APS)
            {
              ap_num = BK7258_WIFI_SCAN_MAX_APS;
            }

          for (index = 0; index < ap_num; index++)
            {
              FAR struct bk7258_wifi_scan_ap_s *dst = &priv->scan_aps[index];
              FAR wifi_scan_ap_info_t *src = &result.aps[index];

              memset(dst, 0, sizeof(*dst));
              memcpy(dst->ssid, src->ssid, BK7258_WIFI_SCAN_SSID_LEN);
              dst->ssid[BK7258_WIFI_SCAN_SSID_LEN] = '\0';
              memcpy(dst->bssid, src->bssid, sizeof(dst->bssid));
              dst->rssi = src->rssi;
              dst->channel = src->channel;
              dst->security = (uint32_t)src->security;
            }

