JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
          priv->scan_count = ap_num;
        }

      priv->scan_in_progress = false;
      priv->scan_complete = true;
    }
  nxmutex_unlock(&priv->scan_lock);

  bk7258_scan_diag_result_exported(ret == BK_OK && result.ap_num > 0 ?
                                  (uint32_t)result.ap_num : 0);
  bk7258_scan_diag_snapshot(&diag);
  {
    /* EVERY MODEM-DOMAIN REGISTER READ IN THIS CALLBACK WAS REMOVED
     * (2026-09-08), for the same reason the parity banner's snapshot was:
     * NXMAC (0x49100000/0x49108000), the modem clock (0x49000000) and CRM
     * (0x49850000) all sit behind the MAC's clock gate, and with
     * CONFIG_PM_V2 && CONFIG_STA_PS compiled in the MAC is put into doze by
     * rwnxl_sleep() at the tail of rwnx_intf_init() (rw_task.c:1245) and is
     * re-woken only inside the core thread, by mac_wakeup_and_pwr_update()
     * (rw_task.c:821), for the duration of the work it dequeued.  A read of
     * a gated register stalls the AHB load forever: the CPU never retires
     * the instruction, so nothing faults (CONFIG_DEBUG_BUSFAULT reports bus
     * ERRORS, not stalls) and no other thread runs to print a clue.  The
     * banner version of this hang looked exactly like a silent console with
     * no nsh prompt and zero bytes of UART response.
     *
     * This callback runs on the event/app thread, NOT on the core thread, so
     * it has no wake guarantee at all -- the MAC may re-enter doze between
     * the scan completing and this callback being dispatched.  The removed
     * reads were written when rwnxl_sleep() was not compiled and the MAC
     * stayed awake for the whole session, which is why they used to work.
     *
     * The authority's own scan-done path reads no MAC register, so deleting
     * these converges on it rather than diverging.
     *
     * If MAC state has to be sampled again, sample it from a context that
     * owns a wake: inside the core thread while it is handling a BMSG (i.e.
     * after mac_wakeup_and_pwr_update() for that message), or from a
     * library callback that already runs with the MAC active.  Do NOT guard
     * such a read by reading a MAC register first -- that probe is itself
     * the stall.  The only safe status sources are the always-on SYS domain
     * (0x44010000, e.g. BK7258_SYS_POWER_WAKEUP below), libwifi's own RAM
     * (ke_state_get(), the ps_env flags) and AON PMU.
     *
     * Kept below: reads that cannot stall.  chan_env/txl_cntrl_env are SRAM
     * symbols resolved at link time; the OFDM/wakeup word is SYS-domain;
     * the ISR counters, the MM task state and the sd1..sd5 counters are all
     * plain memory. */
    extern uint8_t chan_env[];
    extern uint8_t txl_cntrl_env[];

    /* Console is 80 columns and overwrites past ~79 chars, so every
     * diagnostic keeps its payload under ~65 chars after the tag.  Three
     * consecutive boards lost fields to this (vcorehsel twice, the whole
     * MMSTART post line once), which is why these are split. */

    syslog(LOG_INFO, "[BK7258-WIFI] d2b chan=%08lx txhalt=%04x\n",
           (unsigned long)*(volatile uint32_t *)(chan_env + 0x28),
           (unsigned int)*(volatile uint16_t *)(txl_cntrl_env + 0x16e));

    /* SYS domain only (0x44010000 is never gated): the OFDM power-down vote
     * the library reads back through crm_mdm_reset, and the raw wakeup
     * word it lives in.  The `crm14=` field that used to close this line
     * read 0x49850014 and went with the rest. */

    syslog(LOG_INFO, "[BK7258-WIFI] d3a ofdm=%lu pwak=%08lx\n",
           (unsigned long)bk7258_wifi_pwd_ofdm_get_override(),
           (unsigned long)getreg32(BK7258_SYS_POWER_WAKEUP));
  }
  {
    extern volatile uint32_t bk7258_wifi_isr_count[64];
    extern int ke_state_get(uint8_t task_id);

    uint32_t state = (unsigned)ke_state_get(0);  /* TASK_MM = 0 */

    /* THREE PROBES DELETED HERE (2026-09-01) -- all three dereferenced
     * hard-coded closed-library RAM addresses that have since DRIFTED:
     *
     *   cm      0x280700c0 -> now lands in socket_entity+4 (a 12-byte symbol)
     *   in_doze 0x2807bdb1 -> now lands in scanu_env+733
     *   lowpll  0x2807bdb8 -> now lands in scanu_env+740
     *
     * Proof of drift, measured in THIS session: chan_env / txl_cntrl_env /
     * rwnx_env / ke_env each moved by exactly +0x28 between two builds,
     * because adding scan_ssid[33]+scan_ssid_len to struct bk7258_wifi_s
     * pushed every following BSS symbol along.  Any literal address into
     * library RAM is invalidated by an unrelated struct change.
     *
     * Consequence that must be carried forward: the repeated
     * "in_doze=0 lowpll=0, therefore the MAC is not sleeping" conclusion is
     * WITHDRAWN for our side -- those bytes were never the doze status.  The
     * authority board's own in_doze probe is unaffected (its build, its
     * addresses).
     *
     * Rule: reach library state through a linkable global (extern) or a
     * function call, never through a literal.  chan_env/txl_cntrl_env below
     * are `extern` and therefore resolved at link time; ke_state_get is a
     * call.  Those stay. */

    /* Per-source interrupt counts.  The library registers seven handlers via
     * _bk_int_isr_register (board log: sources 36,35,34,33,31,30,29) and the
     * counters have been collected all along in hw_driver_shim.c -- only
     * index 36 was ever printed.  For the stalled directed scan the decisive
     * one is 34 (MAC TX trigger): the probe frame reaches txl_frame_push yet
     * `frame released without call cb` says its confirm never ran, so either
     * the completion interrupt never arrives (count 0 -> enable/routing, or
     * the MAC never raised it) or it arrives and the dispatch chain drops it
     * (count > 0 -> the HISR/workqueue semantics).
     * Source map (Armino sys_struct.h:463-465 + high-bank bits 0-4):
     *   29 modem_mpb  30 modem_riu  31 mac_txrx_timer
     *   32 txrx_misc  33 rx_trigger 34 tx_trigger  35 prot  36 gen */

    syslog(LOG_INFO, "[BK7258-WIFI] isr 29=%lu 30=%lu 31=%lu 32=%lu\n",
           (unsigned long)bk7258_wifi_isr_count[29],
           (unsigned long)bk7258_wifi_isr_count[30],
           (unsigned long)bk7258_wifi_isr_count[31],
           (unsigned long)bk7258_wifi_isr_count[32]);
    syslog(LOG_INFO, "[BK7258-WIFI] isr 33=%lu 34=%lu 35=%lu 36=%lu\n",
           (unsigned long)bk7258_wifi_isr_count[33],
           (unsigned long)bk7258_wifi_isr_count[34],
           (unsigned long)bk7258_wifi_isr_count[35],
           (unsigned long)bk7258_wifi_isr_count[36]);
    syslog(LOG_INFO, "[BK7258-WIFI] mmstate=%lu\n", (unsigned long)state);
    /* WPROBE3 REMOVED (2026-09-01).  It hard-coded 0x2806fb90 as "the hal env
     * pointer" and dereferenced +0xe4/e8/ec/f8 as setfreq inputs.  nm proves
     * that word holds the closed library's saved FUNCS-TABLE pointer
     * (0x2806f810 = g_wifi_os_funcs), so all four "inputs" resolved +0 to our
     * own slot functions (hp_uap_ip_start, hp_uap_ip_down,
     * hp_net_wlan_add_netif, bk7258_wifi_set_sta_status_cb).  Every reading it
     * produced was garbage.
     *
     * The wider lesson (user directive): hard-referencing closed-library
     * internal RAM from outside is not how this port gets fixed.  Eight such
     * probe-driven candidates were falsified this session, while all six real
     * defects came from diffing OUR sources against Armino's sources.
     * Hardware registers stay fair game -- their semantics are recoverable
     * from Armino's own accessor functions -- but library-internal addresses
     * are not.  Remaining offenders of this kind, kept only because they at
     * least report what they claim: the 0x2807bdb1/0x2807bdb8 doze bytes
     * above and the chan_env/txl_cntrl_env externs in scan diag2. */
    /* The "M1: 49108050" line was REMOVED with the rest of the modem-domain
     * reads (2026-09-08).  0x49108050 is in the MAC interrupt block and is
     * gated with the MAC, so reading it here stalls exactly like the others.
     * What it reported -- that hal_machw_init() reached its interrupt-enable
     * step -- is already implied by the scan producing results at all, and
     * by the isr counters printed above (a nonzero count for source 33/34/36
     * cannot happen unless the MAC's interrupt enable was programmed). */
  }
  /* The [NXWIN] register-window dump was REMOVED (2026-09-08): 44 words of
   * getreg32(0x49100000 + n) is the single largest concentration of gated
   * NXMAC reads in the tree, and the first iteration is enough to wedge the
   * CPU on a doze'd MAC.
   *
   * It was a parity tool, not a runtime diagnostic -- its whole purpose was
   * to be diffed against the same dump taken on the authority board.  If
   * that comparison is needed again, take it from a context that holds a
   * wake (see the note at the head of this callback), or better, take it on
   * both boards with STA_PS off in a throwaway image whose only job is the
   * dump; do not carry it in the normal scan path.
   */
  /* The `d3f` probe that used to sit here is DELETED (2026-09-01).
   *
   * It sampled 0x49100010 twice across a 200 us delay and printed it as
   * `tick=`, on the belief that the register was a free-running ke_timer /
   * mm_timer counter.  It is not: 0x49100010 / 0x14 are the NXMAC MAC-ADDRESS
   * registers (authority accessors nxmac_mac_addr_low_get / _hi_get read
   * [base+0x10] / [base+0x14]), and the board proves it -- once bk_get_mac was
   * fixed the pair went from 0/0 to 468c47c8 / 00001502, i.e. exactly the
   * c8:47:8c:46:02:15 read out of flash, matching the authority byte for byte.
   * So every earlier "the tick counter is dead" reading was really "the MAC
   * address register is zero", and the 200 us delay measured nothing.
   *
   * NXWIN row 0x10 already prints both words, so nothing is lost by removing
   * this.  0x491000ac was printed alongside it as `ac=` on an equally
   * unverified guess (nxmac_lp_clk_32786_hz_setf) and is dropped with it. */

  /* MM_RESET/MM_START hardware latches, re-reported from this quiet context.
   * Printing at the sample sites raced with other threads' console output: on
   * sta-mmstate-20260901 the `post` line vanished and the `pre` line was cut
   * in half, losing the only measurement that image existed to take.
   *
   * DO NOT read ke=0 / r38=0 at the post-start column as "mm_active() never
   * ran".  A three-way table saying that was written here once and is wrong:
   * mm_start_req_handler sends the CFM *before* it calls mm_active() and
   * ke_state_set(), then parks the MAC via hal_machw_idle_req().  So the
   * instant rw_msg_send() returns is either ahead of mm_active() or already
   * past the park, and ke=0 / r38=0 there is the expected success path.
   * Board evidence (sta-arminoalign-20260902): all four columns read ke=0,
   * r38=0, ret=0, while the end-of-scan probe reports mmstate=MM_ACTIVE(1)
   * and r38=0x33 -- MM did start.  These four columns therefore say nothing
   * about MM bring-up; they are only useful for registers that are expected
   * to be stable across the whole handshake.
   * States: 0=MM_IDLE 1=MM_ACTIVE 2=GOING_TO_IDLE 3=HOST_BYPASSED
   *         4=MM_NO_IDLE (lmac_msg.h:885-899).  ke=-1 marks a site that has
   *         no ke_state to report (the two reset points).
   *
   * This replaces the old mm1/mm2 pair: hp0 carries the same seen/state/ret
   * fields and hp1 the same r38 values, over four sample points instead of
   * two, so keeping both would only spend scarce console lines twice. */

  bk7258_hwprobe_report();
  /* Was a single 294-character line -- the worst truncation offender in the
   * whole diagnostic set; on an 80-column console only its first ~79 chars
   * plus the final character ever arrived, so 12 of these 17 counters were
   * never actually readable.  Four short lines instead. */

