JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  syslog(LOG_INFO, "[BK7258-WIFI] sd1 req=%lu act=%lu pas=%lu\n",
         (unsigned long)diag.requested_channels,
         (unsigned long)diag.active_channels,
         (unsigned long)diag.passive_channels);
  syslog(LOG_INFO, "[BK7258-WIFI] sd2 ind=%lu done=%lu ins=%lu\n",
         (unsigned long)diag.lmac_result_ind,
         (unsigned long)diag.lmac_complete,
         (unsigned long)diag.result_inserted);
  syslog(LOG_INFO, "[BK7258-WIFI] sd3 full=%lu cty=%lu dup=%lu oom=%lu\n",
         (unsigned long)diag.result_table_full,
         (unsigned long)diag.result_country_drop,
         (unsigned long)diag.result_duplicate,
         (unsigned long)diag.result_alloc_fail);
  syslog(LOG_INFO, "[BK7258-WIFI] sd4 bcn=%lu pr=%lu nosta=%lu\n",
         (unsigned long)diag.host_mgmt_beacon,
         (unsigned long)diag.host_mgmt_probe_resp,
         (unsigned long)diag.host_mgmt_no_sta_vif);
  syslog(LOG_INFO, "[BK7258-WIFI] sd5 qdrop=%lu fwd=%lu exp=%lu fail=%lu\n",
         (unsigned long)diag.host_mgmt_wpaq_drop,
         (unsigned long)diag.host_mgmt_wpaq_forwarded,
         (unsigned long)diag.result_exported,
         (unsigned long)diag.result_fetch_fail);

  bk_wifi_scan_free_result(&result);
  return BK_OK;
}

/* Declared here rather than by including <bk_private/bk_rw.h>: that header
 * pulls in fhost_msg.h, fhost_mac.h and pbuf.h, and our own
 * hal_port/include/pbuf.h includes bk_rw.h back, so including it here would drag a
 * circular chain into this file.  Same single-symbol extern pattern the
 * chan_env/txl_cntrl_env declarations in the scan-done probe already use.
 *
 * Provenance: bk_rw.h:389, defined at rwnx_utils.c:108 (which forwards to
 * mac_vif_mgmt_mac_to_index).  Both are linked into the image -- verified with
 * nm: rwm_mgmt_vif_mac2idx and mac_vif_mgmt_mac_to_index are both T.
 *
 * wifi_netif_mac_to_vifid() would have been the tidier wrapper, but
 * wifi_netif.c is not in the build set (wifi/CMakeLists.txt lists only
 * rwnx_utils.c from that directory), so the symbol is absent from the ELF. */

extern uint8_t rwm_mgmt_vif_mac2idx(void *mac);

/* Association is the point where the link becomes usable, so it is where
 * carrier rises.
 *
 * Ordering is what makes this correct rather than merely plausible.  The
 * authority posts EVENT_WIFI_STA_CONNECTED from notify.c:346-370, *after* the
 * key material has been installed into the MAC.  Board evidence
 * (evidence-20260908/bk7258-connect-SUCCESS-2-26a68589.log) shows exactly
 * that order:
 *
 *   1962  [hitf] add hw key idx=8      <- PTK into a hardware slot
 *   1988  [hitf] add hw key idx=1      <- GTK into a hardware slot
 *   1989  [wpa]  Key negotiation completed [PTK=CCMP GTK=CCMP]
 *   1998  [wpa]  CTRL-EVENT-CONNECTED
 *
 * So by the time carrier rises the encrypted data path is genuinely usable;
 * there is no window where the stack could transmit before the keys are in
 * place.
 *
 * This differs in shape from the authority, which never raises link state
 * dynamically at all: it burns NETIF_FLAG_LINK_UP into the flags initialiser
 * (wlanif.c:137) because its lwIP netif is created on association, so the
 * netif's existence *is* the link-up signal.  NuttX registers the netdev once
 * at boot (bk7258_wifi_lower_register below, from the init path), long before
 * any association, so the same fact has to be carried by the carrier flag
 * instead.  Adapting this is an RTOS integration point, not a divergence --
 * unconditionally raising carrier at register time would be the divergence,
 * because the stack would then transmit while unassociated.
 */

static bk_err_t bk7258_wifi_sta_connected(void *arg, event_module_t module,
                                          int event_id, void *event_data)
{
  FAR struct bk7258_wifi_s *priv = arg;
  uint8_t vif_idx;

  if (priv == NULL || module != EVENT_MOD_WIFI ||
      event_id != EVENT_WIFI_STA_CONNECTED)
    {
      return BK_OK;
    }

  /* event_data is deliberately unused: wifi_event_sta_connected_t carries only
   * ssid and bssid (wifi_types.h:684-687), no vif index, so the vif has to be
   * resolved from our own MAC below. */

  (void)event_data;

  if (!priv->registered)
    {
      /* The event callback is installed in bk7258_wifi_lower_init(), which
       * runs before bk7258_wifi_lower_register().  Nothing can associate in
       * that window, but touching an unregistered netdev is not worth the
       * risk of being wrong about that. */

      syslog(LOG_WARNING, "[BK7258-WIFI] connected: netdev not registered\n");
      return BK_OK;
    }

  /* Resolve the STA vif index the same way the authority does when it needs
   * the vif for its own MAC: rwm_mgmt_vif_mac2idx() on the station address
   * (wifi_v2.c:3086 passes &g_sta_param_ptr->own_mac to it).  The zero-MAC
   * rejection is the authority's too, from the wrapper we cannot link
   * (wifi_netif.c:31-33) -- a zeroed address must not be looked up, because
   * index 0 is a valid vif and would silently look like success.
   *
   * Until now vif_idx was never assigned anywhere, so it held the zero left by
   * the static initialiser.  Zero happens to be the right STA vif, which is
   * why TX worked, but by coincidence rather than by construction.  Filling it
   * from the association matters because bmsg_tx_handler() returns *without
   * freeing* when vif_idx == INVALID_VIF_IDX (rw_task.c:178), a failure that
   * from the outside is indistinguishable from "the frame was never
   * submitted". */

  if ((priv->mac[0] | priv->mac[1] | priv->mac[2] |
       priv->mac[3] | priv->mac[4] | priv->mac[5]) == 0)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] connected: own MAC is zero; "
                      "keeping vif=%u\n", (unsigned)priv->vif_idx);
    }
  else
    {
      vif_idx = rwm_mgmt_vif_mac2idx(priv->mac);
      if (vif_idx == BK7258_INVALID_VIF_IDX)
        {
          syslog(LOG_ERR, "[BK7258-WIFI] connected: vif lookup failed; "
                          "keeping vif=%u\n", (unsigned)priv->vif_idx);
        }
      else
        {
          priv->vif_idx = vif_idx;
        }
    }

  syslog(LOG_INFO, "[BK7258-WIFI] connected: carrier on, vif=%u\n",
         (unsigned)priv->vif_idx);

  bk7258_wifi_lower_carrier_on(priv);
  return BK_OK;
}

static bk_err_t bk7258_wifi_sta_disconnected(void *arg, event_module_t module,
                                             int event_id, void *event_data)
{
  FAR struct bk7258_wifi_s *priv = arg;
  FAR wifi_event_sta_disconnected_t *info = event_data;

  if (priv == NULL || module != EVENT_MOD_WIFI ||
      event_id != EVENT_WIFI_STA_DISCONNECTED)
    {
      return BK_OK;
    }

  if (!priv->registered)
    {
      return BK_OK;
    }

  /* Carrier drops on every disconnect, including a locally requested one:
   * either way the encrypted data path is gone.  netdev_carrier_off() is
   * guarded by IFF_IS_RUNNING (netdev_carrier.c:84), so a disconnect event
   * arriving while carrier is already down is a no-op -- which matters,
   * because EVENT_WIFI_STA_DISCONNECTED is posted from several places
   * (rw_msg_rx.c:1630, notify.c:471,488, config_none.c:168,231,
   * wpa_scan.c:2912) and may well arrive more than once per failure. */

  syslog(LOG_INFO, "[BK7258-WIFI] disconnected: carrier off, reason=%d "
                   "local=%d\n",
         info != NULL ? info->disconnect_reason : -1,
         info != NULL ? (int)info->local_generated : -1);

