JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  bk7258_wifi_lower_carrier_off(priv);
  return BK_OK;
}
#endif

int bk7258_wifi_lower_register(struct bk7258_wifi_s *priv)
{
  int ret;

  priv->lower.ops = &g_bk7258_net_ops;
#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
  priv->lower.iw_ops = &g_bk7258_iw_ops;
#endif
  atomic_init(&priv->lower.quota[NETPKT_TX], 1);

  /* RX quota 4: quota 1 silently drops the ARP reply when competing
   * broadcast/multicast frames (mDNS, SSDP, neighbor ARP) arrive in the
   * same window.  netpkt_alloc() returns NULL on quota exhaustion and the
   * frame is freed in rx_submit before netdev statistics, so ifconfig
   * shows Dropped=0 while frames are lost.  Board evidence: 3 bmsg_rx_handler
   * calls after the ARP request with quota=1, yet arp_wait timed out.
   *
   * The earlier quota=8 attempt coincided with a scan hang, but the probe
   * proving the changed line executed was itself upstream of it (the rx#
   * probe printed nothing), so the correlation is unexplained and likely
   * coincidental.  quota=4 is a conservative middle ground. */

  atomic_init(&priv->lower.quota[NETPKT_RX], 4);

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  /* Link-layer address.  This is the counterpart of the authority's
   * low_level_init(), which fills the lwIP netif from the vif's MAC:
   *
   *   netif->hwaddr_len = ETHARP_HWADDR_LEN;
   *   os_memcpy(netif->hwaddr, macptr, ETHARP_HWADDR_LEN);
   *
   * (cp/components/lwip_intf_v2_1/lwip-2.1.2/port/wlanif.c:130-131, where
   * macptr is wifi_netif_vif_to_mac(vif)).  Same fact, different field name:
   * NuttX keeps the link-layer address in net_driver_s.d_mac, lwIP in
   * netif->hwaddr.
   *
   * Done here rather than on association because the address is a property of
   * the chip, not of the link: bk_wifi_init() has already run by the time this
   * is reached, so the accessor resolves to the cached bk_get_mac() value.
   *
   * A failure is not fatal.  Leaving d_mac zeroed keeps the interface
   * registered and inspectable via ifconfig, which is what makes the failure
   * diagnosable at all -- whereas refusing to register would remove the only
   * place the missing address is visible. */

  if (bk7258_wifi_sta_own_mac(priv->mac) == OK)
    {
      memcpy(PRIV2LOWER(priv)->netdev.d_mac.ether.ether_addr_octet,
             priv->mac, sizeof(priv->mac));
    }
  else
    {
      syslog(LOG_ERR, "[BK7258-WIFI] register: own MAC unavailable; "
                      "d_mac left zeroed\n");
    }
#endif

  ret = netdev_lower_register(PRIV2LOWER(priv), NET_LL_IEEE80211);
  if (ret < 0)
    {
      return ret;
    }

  priv->registered = true;
  priv->carrier = false;
  return OK;
}

void bk7258_wifi_lower_carrier_on(struct bk7258_wifi_s *priv)
{
  priv->carrier = true;
  netdev_lower_carrier_on(PRIV2LOWER(priv));
}

void bk7258_wifi_lower_carrier_off(struct bk7258_wifi_s *priv)
{
  priv->carrier = false;
  netdev_lower_carrier_off(PRIV2LOWER(priv));
}

void bk7258_wifi_lower_rx_ready(struct bk7258_wifi_s *priv)
{
  netdev_lower_rxready(PRIV2LOWER(priv));
}

void bk7258_wifi_lower_tx_done(struct bk7258_wifi_s *priv)
{
  netdev_lower_txdone(PRIV2LOWER(priv));
}

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME

/* Both of the following are runtime-gated for the same reason the EAPOL split
 * in ethernetif_input() is: bk_wifi_sta_get_mac() comes from <modules/wifi.h>,
 * and BK7258_ETH_HDR_LEN and <syslog.h> are equally only in scope under this
 * symbol (see the include block at the top of the file).  The CP image builds
 * with the vendor runtime disabled and must not reference any of them. */

int bk7258_wifi_sta_own_mac(FAR uint8_t *mac)
{
  if (mac == NULL)
    {
      return -EINVAL;
    }

  /* The same accessor the EAPOL RX split uses above, deliberately: it is what
   * the vendor bridge treats as the vif's address, so a frame built with it
   * carries the source the closed library expects.  bk7258_wifi_board_get_mac()
   * is NOT equivalent -- it is a raw partition read, and bk_get_mac() applies
   * validation and per-type handling on top of it (hal_port_mac.c:100,126). */

  if (bk_wifi_sta_get_mac(mac) != BK_OK)
    {
      return -EIO;
    }

  return OK;
}

int bk7258_wifi_lower_tx_inject(FAR const uint8_t *frame, uint16_t len)
{
  FAR struct bk7258_wifi_s *priv = &g_bk7258_wifi;
  struct pbuf *p;

  if (frame == NULL)
    {
      return -EINVAL;
    }

  /* Strictly greater than the header: the vendor descriptor describes the
   * payload as (p->payload + sizeof(ETH_HDR_T), len - sizeof(ETH_HDR_T))
   * (rwnx_tx.c:753), so a 14-byte frame would claim a zero-length payload. */

  if (len <= BK7258_ETH_HDR_LEN || len > BK7258_WIFI_FRAME_MAX)
    {
      return -EMSGSIZE;
    }

  if (!priv->registered)
    {
      return -ENODEV;
    }

  p = pbuf_alloc(PBUF_RAW_TX, len, PBUF_RAM);
  if (p == NULL)
    {
      return -ENOMEM;
    }

  memcpy(p->payload, frame, len);

  /* priv->vif_idx is never assigned anywhere in the tree, so it is the zero
   * from static initialisation.  Zero happens to be the right STA vif -- the
   * reference TX descriptors log vif=0 -- but by coincidence, not by design;
   * it has to be filled from the association event before the data plane is
   * integrated.  Printed here because bmsg_tx_handler() returns without
   * freeing when vif_idx == INVALID_VIF_IDX (rw_task.c:178), which from the
   * outside looks identical to "the frame was never submitted". */

  syslog(LOG_WARNING, "[BK7258] txinject len=%u vif=%u\n",
         (unsigned)len, (unsigned)priv->vif_idx);

  return bk7258_wifi_tx_pbuf(priv, p);
}

#endif /* CONFIG_BK7258_WIFI_VENDOR_RUNTIME */

void bk7258_wifi_lower_rx_submit(struct bk7258_wifi_s *priv,
                                 struct bk7258_vpkt *vpkt)
{
  FAR struct iob_s *iob;
  unsigned int len;

  if (priv == NULL || vpkt == NULL || !priv->registered)
    {
      bk7258_vpkt_free(vpkt);
      return;
    }

  /* The lower bound is now a hard requirement, not just a sanity check: the
   * netpkt_copyin() below writes the frame starting at -NET_LL_HDRLEN, so a
   * frame without a full Ethernet header plus at least one payload byte would
   * reach the stack with io_pktlen == 0. */

