JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  len = vpkt->tot_len;
  if (len <= BK7258_ETH_HDR_LEN || len > BK7258_WIFI_FRAME_MAX)
    {
      bk7258_vpkt_free(vpkt);
      return;
    }

  /* netpkt_alloc/netpkt_copyin rather than raw iob calls, because the offset
   * arithmetic is the whole bug.  netpkt_copyin() passes
   * `offset - NET_LL_HDRLEN` down to iob_trycopyin(), so offset 0 writes at -14
   * and the Ethernet header lands in the reserve area, leaving IOB_DATA on the
   * L3 payload.  That is what eth_input() and arp_in() expect:
   *
   *   IPBUF(hl) = IOB_DATA(d_iob) + hl          netdev.h:206
   *   NETLLBUF  = IPBUF(0) - NET_LL_HDRLEN      netdev.h:207
   *
   * The previous code did iob_reserve() + iob_trycopyin(offset 0) by hand, which
   * put the whole frame after the reserve area and left IOB_DATA on the Ethernet
   * header -- one header too early for every stack reader.  Board evidence:
   * well-formed ARP replies arrived (rx#13 et=0806 tail=00 01 08 00 06 04) while
   * arp_in() reported "Invalid hardware type", because ah_hwtype was read from
   * the destination MAC.
   *
   * netpkt_alloc() also accounts the RX quota, which the raw iob_tryalloc() path
   * never did while the upper half kept returning quota in netpkt_put(). */

  iob = netpkt_alloc(PRIV2LOWER(priv), NETPKT_RX);
  if (iob == NULL)
    {
      bk7258_vpkt_free(vpkt);
      return;
    }

  if (netpkt_copyin(PRIV2LOWER(priv), iob, vpkt->payload, len, 0) < 0)
    {
      netpkt_free(PRIV2LOWER(priv), iob, NETPKT_RX);
      bk7258_vpkt_free(vpkt);
      return;
    }

  /* No netpkt_setdatalen() here.  The spec lists a missing setdatalen as an
   * anti-pattern (eth_netdev_pattern.md:766-773), but that case is a driver
   * whose copy does not update the packet length.  netpkt_copyin() ->
   * iob_trycopyin() already extends io_pktlen over what it wrote, and the board
   * agrees: the run without setdatalen reported RX Bytes=0x2a for a 42-byte ARP
   * frame, i.e. the length was already right.  Adding the call on top coincided
   * with scan hanging, so it stays out. */

  if (bk7258_wifi_rx_enqueue(priv, iob) < 0)
    {
      netpkt_free(PRIV2LOWER(priv), iob, NETPKT_RX);
      bk7258_vpkt_free(vpkt);
      return;
    }

  bk7258_vpkt_free(vpkt);
  netdev_lower_rxready(PRIV2LOWER(priv));
}

/****************************************************************************
 * Public entry
 ****************************************************************************/

/* One-line-per-subsystem parity snapshot printed once at init completion.
 * Reads only: no SSID/BSSID/frame data.  The slot list covers every group
 * where the authoritative initializer binds and this port may stay NULL
 * (EVM/ATE, netif/IP glue, power-save stubs, CSI, vendor-IE, airkiss,
 * low-analog, dcache) so a bring-up trace shows the remaining divergence
 * surface without another audit round. */
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
static void bk7258_wifi_parity_banner(void)
{
  static const struct
  {
    const char *name;
    size_t off;
  } slots[] =
  {
    { "_do_evm",                     offsetof(wifi_os_funcs_t, _do_evm) },
    { "_bk_feature_csi_out_cb",      offsetof(wifi_os_funcs_t, _bk_feature_csi_out_cb) },
    { "_send_udp_bc_pkt",            offsetof(wifi_os_funcs_t, _send_udp_bc_pkt) },
    { "_save_net_info",              offsetof(wifi_os_funcs_t, _save_net_info) },
    { "_sta_ip_down",                offsetof(wifi_os_funcs_t, _sta_ip_down) },
    { "_mac_sleeped",                offsetof(wifi_os_funcs_t, _mac_sleeped) },
    { "_mcu_ps_machw_init",          offsetof(wifi_os_funcs_t, _mcu_ps_machw_init) },
    { "_sys_hal_enter_low_analog",   offsetof(wifi_os_funcs_t, _sys_hal_enter_low_analog) },
    { "_flush_all_dcache",           offsetof(wifi_os_funcs_t, _flush_all_dcache) },
    { "_vendor_ie_cb",               offsetof(wifi_os_funcs_t, _bk_wifi_get_vendor_ie_cb_internal) },
  };
  char nulls[144];
  size_t used = 0;

  nulls[0] = '\0';
  for (size_t i = 0; i < nitems(slots); i++)
    {
      if (*(void *const *)((const char *)&g_wifi_os_funcs + slots[i].off) == NULL)
        {
          int written = snprintf(nulls + used, sizeof(nulls) - used,
                                 "%s ", slots[i].name);
          if (written < 0 || (size_t)written >= sizeof(nulls) - used)
            {
              break;
            }
          used += (size_t)written;
        }
    }

  syslog(LOG_INFO,
         "[BK7258-WIFI] parity: null-vs-authoritative: %s\n",
         nulls[0] != '\0' ? nulls : "(none)");

  /* The NXMAC/CRM register snapshot that used to follow this line was
   * removed (2026-09-08).  It read 0x49100120 twice, then 0x49100000,
   * 0x49100504, 0x49100038 and 0x49850010, which is no longer a legal
   * access point.
   *
   * With CONFIG_PM_V2 && CONFIG_STA_PS compiled in, rwnx_intf_init() ends in
   * rwnxl_sleep() (rw_task.c:1245), so the MAC is deliberately in doze by the
   * time this banner runs.  Reading a clock-gated NXMAC stalls the AHB load
   * indefinitely: the CPU never retires the instruction, so no fault is
   * raised (CONFIG_DEBUG_BUSFAULT cannot report a stall, only an error) and
   * no other thread ever runs to print anything.
   *
   * That is precisely the hang this banner caused.  The [initseq] boundary
   * trace showed every init step completing normally -- including
   * rwnxl_sleep() itself and bk_wifi_init() returning with
   * "wifi inited(1) ret(0)" -- and then the syslog above was the last output
   * on the console, with no nsh prompt for the rest of the capture.
   *
   * The snapshot had also stopped measuring what it was written for.  It
   * dates from the scan era, when rwnxl_sleep() was not compiled and the MAC
   * stayed awake, so an active FSM value here carried information.  After the
   * sleep call it can only ever show doze.  Sample the MAC while it is known
   * to be awake (the scan and assoc paths already do) rather than
   * reinstating these reads at init completion.
   */
}
#endif

bool bk7258_wifi_is_ready(void)
{
  return atomic_load_explicit(&g_bk7258_wifi_init_state,
                              memory_order_acquire) ==
         BK7258_WIFI_INIT_READY;
}

/****************************************************************************
 * STA association
 *
 * Transcribed from the authority's own caller, demo_sta_app_init()
 * (cp/components/bk_wifi/src/wifi_api.c:185-210), which is the variant that
 * takes just an SSID and a passphrase -- no BSSID, no hard-coded channel.
 * That file also sits in our tree byte-identical to the authority copy (it is
 * simply not compiled), so the sequence below can be checked against it line
 * by line.  The two callees are byte-identical to the authority as well: our
 * wifi_v2.c differs from cp/components/bk_wifi/src/wifi_v2.c in only four
 * places (include depth, one #if/#ifdef, the g_wifi_funcs/g_wifi_vars
 * definition that belongs to funcs_fill.c here, and a trailing newline) --
 * none of them inside a function body.
 *
 * Guarded like bk7258_wifi_scan(): bk_wifi_sta_start() reaches
 * wpa_psk_request() and wlan_sta_enable(), whose providers
 * (wpa_psk_cache.c, wpa_ctrl_iface.c, sa_station.c) are inside the
 * CONFIG_BK7258_WIFI_VENDOR_RUNTIME block of CMakeLists.txt, so the
 * runtime-disabled CP image must not reference them.
 ****************************************************************************/

