JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME

/* Both vendor buffers are NUL-terminated (wifi_types.h:63 and :67):
 * WIFI_SSID_STR_LEN == 32+1, WIFI_PASSWORD_LEN == 64+1.  A WPA2 passphrase is
 * 8..63 characters, or exactly 64 hex digits when a raw PMK is supplied. */

int bk7258_wifi_sta_connect(FAR const char *ssid, FAR const char *psk)
{
  wifi_sta_config_t config;
  size_t ssid_len;
  size_t psk_len;
  bk_err_t ret;

  if (ssid == NULL || psk == NULL)
    {
      return -EINVAL;
    }

  /* The vendor call chain asserts on an uninitialized stack: bk_wifi_init()
   * must have run so that cfg_param_init() has allocated g_sta_param_ptr,
   * which bk_wifi_sta_set_config() dereferences without a NULL check. */

  if (!bk7258_wifi_is_ready())
    {
      return -ENODEV;
    }

  ssid_len = strlen(ssid);
  psk_len = strlen(psk);

  /* DELIBERATE DEVIATION from the transcribed original, which uses
   * os_strcpy() for both fields and length-checks only the SSID
   * (wifi_api.c:191-204).  That is safe there because its arguments are
   * compile-time constants; ours arrive from a command line, so an
   * over-long argument would run off a 33- or 65-byte struct member.  The
   * copies below are bounded and both lengths are rejected up front. */

  if (ssid_len == 0u || ssid_len >= sizeof(config.ssid))
    {
      syslog(LOG_ERR, "[BK7258-WIFI] connect: ssid length %u, need 1..%u\n",
             (unsigned)ssid_len, (unsigned)(sizeof(config.ssid) - 1u));
      return -EINVAL;
    }

  /* psk_len == 0 selects an open (no-password) network: config.password
   * stays zeroed after the memset below, and the vendor supplicant
   * auto-detects security from scan results.  A non-empty PSK must still
   * satisfy the 8..63 / 64-hex rules. */
  if (psk_len > 0u &&
      (psk_len < BK7258_WIFI_PSK_MIN_LEN ||
       psk_len >= sizeof(config.password)))
    {
      syslog(LOG_ERR, "[BK7258-WIFI] connect: psk length %u, need %u..%u "
             "or 0 for open\n",
             (unsigned)psk_len, (unsigned)BK7258_WIFI_PSK_MIN_LEN,
             (unsigned)(sizeof(config.password) - 1u));
      return -EINVAL;
    }

  /* Zeroed exactly as the original does with `= {0}`.  Two consequences are
   * load-bearing rather than incidental:
   *   - reserved[32] must be all zero or wifi_sta_validate_config() rejects
   *     the config outright (wifi_v2.c:2669, WIFI_RESERVED_BYTE_VALUE == 0);
   *   - is_user_fast_connect must stay 0, otherwise validate_config takes the
   *     g_fci overwrite branch at wifi_v2.c:2672.
   * security is left 0 (== WIFI_SECURITY_NONE) because the original leaves it
   * so; the STA path never reads it -- wifi_sta_set_global_config()
   * (wifi_v2.c:2732) copies ssid and password but not security.
   */

  memset(&config, 0, sizeof(config));
  memcpy(config.ssid, ssid, ssid_len);
  memcpy(config.password, psk, psk_len);

  /* SSID and lengths only.  The passphrase itself is never logged, here or
   * in the status path. */

  if (psk_len == 0u)
    {
      syslog(LOG_INFO, "[BK7258-WIFI] connect: ssid=\"%s\" (%u), open\n",
             config.ssid, (unsigned)ssid_len);
    }
  else
    {
      syslog(LOG_INFO, "[BK7258-WIFI] connect: ssid=\"%s\" (%u), psk %u chars\n",
             config.ssid, (unsigned)ssid_len, (unsigned)psk_len);
    }

  /* set_config before start, as in the original.  set_config is also what
   * populates g_sta_param_ptr->ssid/key, which is what wpa_psk_request()
   * reads inside bk_wifi_sta_start() (wifi_v2.c:2477); calling start alone
   * would derive a PSK from an empty SSID and key.  If a link is already up,
   * set_config disconnects first and re-connects on its own
   * (wifi_v2.c:2983-3010). */

  ret = bk_wifi_sta_set_config(&config);
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] connect: set_config failed=%d\n",
             (int)ret);
      return -EIO;
    }

  ret = bk_wifi_sta_start();
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] connect: sta_start failed=%d\n",
             (int)ret);
      return -EIO;
    }

  /* Association and the 4-way handshake run asynchronously from here; the
   * caller polls bk7258_wifi_sta_connect_status(). */

  syslog(LOG_INFO, "[BK7258-WIFI] connect: request accepted\n");
  return OK;
}

int bk7258_wifi_sta_connect_status(FAR int *state, FAR int *reason)
{
  wifi_linkstate_reason_t info;
  bk_err_t ret;

  if (!bk7258_wifi_is_ready())
    {
      return -ENODEV;
    }

  /* bk_wifi_sta_get_linkstate_with_reason(), not bk_wifi_sta_get_link_status():
   * the latter returns early with a bare DISCONNECTED once
   * wifi_sta_is_connected() is false (wifi_v2.c:3078-3082), which discards the
   * reason code precisely when a failure needs explaining.  This one reads
   * mhdr_get_station_status() directly and keeps both fields. */

  memset(&info, 0, sizeof(info));
  ret = bk_wifi_sta_get_linkstate_with_reason(&info);
  if (ret != BK_OK)
    {
      return -EIO;
    }

  if (state != NULL)
    {
      *state = (int)info.state;
    }

  if (reason != NULL)
    {
      *reason = (int)info.reason_code;
    }

  return OK;
}

bool bk7258_wifi_sta_is_connected(void)
{
  int state;

  /* Same test as the vendor's own wifi_netif_sta_is_connected()
   * (cp/components/bk_wifi/src/wifi_netif.c:157-160): compare the link state
   * against CONNECTED exactly.  Note the comparison is strict, so a link that
   * has advanced to GOT_IP would read as not-connected -- the vendor keeps a
   * separate wifi_netif_sta_is_got_ip() for that.  That cannot happen here:
   * CONFIG_LWIP is unset in this profile, so nothing runs a DHCP client and
   * CONNECTED is the terminal state of the association path we implement. */

  if (bk7258_wifi_sta_connect_status(&state, NULL) < 0)
    {
      return false;
    }

  return state == WIFI_LINKSTATE_STA_CONNECTED;
}

FAR const char *bk7258_wifi_sta_state_str(int state)
{
  switch (state)
    {
      case WIFI_LINKSTATE_STA_IDLE:           return "IDLE";
      case WIFI_LINKSTATE_STA_CONNECTING:     return "CONNECTING";
      case WIFI_LINKSTATE_STA_DISCONNECTED:   return "DISCONNECTED";
      case WIFI_LINKSTATE_STA_CONNECTED:      return "CONNECTED";
      case WIFI_LINKSTATE_STA_CONNECT_FAILED: return "CONNECT_FAILED";
      case WIFI_LINKSTATE_STA_GOT_IP:         return "GOT_IP";
      case WIFI_LINKSTATE_STA_SCAN_DONE:      return "SCAN_DONE";
      default:                                return "unknown";
    }
}

FAR const char *bk7258_wifi_sta_reason_str(int reason)
{
  /* Only the codes that plausibly end a WPA2-PSK association attempt are
   * named; the caller prints the raw number too, so an unnamed code is still
   * traceable to wifi_types.h.  WIFI_REASON_MAX is the vendor's "connected
   * successfully" sentinel, not an error (wifi_types.h:246). */

  switch (reason)
    {
      case WIFI_REASON_MAX:
        return "SUCCESS";
      case WIFI_REASON_RESERVED:
        return "none";
      case WIFI_REASON_UNSPECIFIED:
        return "UNSPECIFIED";
      case WIFI_REASON_PREV_AUTH_NOT_VALID:
        return "PREV_AUTH_NOT_VALID";
      case WIFI_REASON_DEAUTH_LEAVING:
        return "DEAUTH_LEAVING";
      case WIFI_REASON_MICHAEL_MIC_FAILURE:
        return "MICHAEL_MIC_FAILURE";
      case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
        return "4WAY_HANDSHAKE_TIMEOUT";
      case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:
        return "GROUP_KEY_UPDATE_TIMEOUT";
      case WIFI_REASON_IE_IN_4WAY_DIFFERS:
        return "IE_IN_4WAY_DIFFERS";
      case WIFI_REASON_GROUP_CIPHER_NOT_VALID:
        return "GROUP_CIPHER_NOT_VALID";
      case WIFI_REASON_PAIRWISE_CIPHER_NOT_VALID:
        return "PAIRWISE_CIPHER_NOT_VALID";
      case WIFI_REASON_AKMP_NOT_VALID:
        return "AKMP_NOT_VALID";
      case WIFI_REASON_IEEE_802_1X_AUTH_FAILED:
        return "IEEE_802_1X_AUTH_FAILED";
      case WIFI_REASON_CIPHER_SUITE_REJECTED:
        return "CIPHER_SUITE_REJECTED";
      case WIFI_REASON_BEACON_LOST:
        return "BEACON_LOST";
      case WIFI_REASON_NO_AP_FOUND:
        return "NO_AP_FOUND";
      case WIFI_REASON_WRONG_PASSWORD:
        return "WRONG_PASSWORD";
      case WIFI_REASON_DISCONNECT_BY_APP:
        return "DISCONNECT_BY_APP";
      case WIFI_REASON_DHCP_TIMEOUT:
        return "DHCP_TIMEOUT";
      default:
        return "unknown";
    }
}

#else /* CONFIG_BK7258_WIFI_VENDOR_RUNTIME */

