JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
int bk7258_wifi_sta_connect(FAR const char *ssid, FAR const char *psk)
{
  return -ENOSYS;
}

int bk7258_wifi_sta_connect_status(FAR int *state, FAR int *reason)
{
  return -ENOSYS;
}

bool bk7258_wifi_sta_is_connected(void)
{
  return false;
}

FAR const char *bk7258_wifi_sta_state_str(int state)
{
  return "unsupported";
}

FAR const char *bk7258_wifi_sta_reason_str(int reason)
{
  return "unsupported";
}

#endif /* CONFIG_BK7258_WIFI_VENDOR_RUNTIME */

static int bk7258_wifi_initialize_once(void)
{
  int ret;

  /* bk_init.c ordering alignment: vote CPU to 120M and apply the vendor
   * calibration overlay BEFORE any wifi/phy/calibration path runs --
   * delay10us/200us loops and the calibration sequencer assume the CPU
   * is at the voted frequency, and the calibration tables must be in
   * place before calibration_init consumes them inside bk_wifi_init. */
  {
    extern bk_err_t bk_pm_module_vote_cpu_freq(uint32_t dev, uint32_t frq);
    extern void hp_dvfs_log_state(const char *tag);
    bk_err_t freq_ret;

    /* pm.h:340 PM_DEV_ID_DEFAULT == 41 and pm.h:349 PM_CPU_FRQ_120M == 3.
     * The previous (26, 2) passed PM_DEV_ID_MAC / PM_CPU_FRQ_80M -- harmless
     * only while the callee ignored its arguments. */
    hp_dvfs_log_state("pre-vote");
    freq_ret = bk_pm_module_vote_cpu_freq(41 /* PM_DEV_ID_DEFAULT */,
                                         3 /* PM_CPU_FRQ_120M */);
    hp_dvfs_log_state("post-vote");
    syslog(LOG_INFO,
           "[BK7258-WIFI] boot: cpu_freq vote 120M ret=%d\n", (int)freq_ret);
  }

  ret = bk7258_wifi_osal_init();
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_wifi_hw_init();
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_wifi_board_init();
  if (ret < 0)
    {
      return ret;
    }

#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  {
    /* Armino runs bk_trng_driver_init() from driver_early_init()
     * (cp/middleware/driver/common/driver.c:275-277, CONFIG_TRNG_SUPPORT=y in
     * projects/app/cp/config/bk7258/config), i.e. before every driver_init()
     * peripheral including SARADC.  Keep that relative order here: this call
     * goes ahead of bk_adc_driver_init() for the same reason the AON RTC call
     * below deliberately goes after it.
     *
     * BK7258 needs no clock or power gate for this block -- authority only
     * touches sys_drv_trng_disckg_set() under CONFIG_SOC_BK7256XX, which is 0
     * in this profile (hal_port/include/common/sys_config.h:23), and bk_trng_start()
     * itself bypasses the block's clock gate (trng_ll.h:59). */

    extern void sys_hal_low_power_hardware_init(void);
    extern bk_err_t bk_trng_driver_init(void);
    extern int hp_bandgap_init(void);
    extern int bk_rand(void);
    extern bk_err_t bk_adc_driver_init(void);

    /* Armino pm_hardware_init() (components/bk_pm/pm.c:213) ->
     * sys_drv_low_power_hardware_init() (sys_ps_driver.c:191) ->
     * sys_hal_low_power_hardware_init() (sys_pm_hal.c:1508), imported whole
     * under pm/authority.  Upstream reaches it from CPU0 startup
     * (startup_cpu0.c:402), i.e. ahead of driver_early_init(), so it goes
     * first in this block.
     *
     * This is the step that establishes the analog and low-power state the
     * rest of the PM code reads back.  Most of all it runs
     * sys_hal_enable_buck(), which is the only writer of ana_reg11.aldosel --
     * the bit sys_hal_exit_low_analog() branches on to decide whether to
     * restore vanaldosel to 0x5 (LDO) or 4 (buck).  Without it that read
     * returned whatever reset left behind, so porting exit_low_analog() alone
     * aligned a leaf while leaving the code that establishes its input
     * unaligned.
     *
     * Ordering against the manual R41.lpo_config write further down is safe in
     * both directions: sys_hal_config_32k_source_default() inside this call
     * selects ROSC as well (bk_clk_32k_customer_config_get() falls through to
     * PM_LPO_SRC_ROSC here, see the divergence note below), and it touches
     * R41.wakeup_ena, a different field from lpo_config bits[1:0].  The AON
     * RTC init still runs after the lpo_config write, keeping the constraint
     * that the counter is only enabled once its clock source is settled.
     *
     * DELIBERATE DIVERGENCE: CONFIG_LPO_MP_A_FORCE_USE_EXT32K is set in the
     * authority BK7258 CP config but is left undefined here.  With it set,
     * bk_clk_32k_customer_config_get() returns PM_LPO_SRC_X32K on MP_A silicon
     * and config_32k_source_default() would switch the 32 kHz source to the
     * external crystal, powering up the XTAL and repointing the buck clock.
     * This board is verified running on ROSC, and an X32K source also shifts
     * the rwnxl_sleep threshold; switching it blind on the same change that is
     * meant to fix the analog state would confound both.  Revisit once the die
     * ID is read back and an external 32 kHz crystal is confirmed present. */

    /* sys_hal_low_power_hardware_init() used to be called here.  It now runs
     * from __start() ahead of nx_start() (bk7258_start.c), which is where the
     * authority calls it -- one line before its RTOS entry point
     * (startup_cpu0.c:402-407).  See that call site for why the position is
     * load-bearing: the function switches the AHBP power domain off, PSRAM
     * belongs to that domain, and PSRAM is 16 MiB of our heap, so calling it
     * once PSRAM had been in the heap all boot destroyed the heap contents. */

    ret = bk_trng_driver_init();
    if (ret != BK_OK)
      {
        syslog(LOG_ERR, "[BK7258-WIFI] runtime: TRNG init failed=%d\n", ret);
        bk7258_wifi_hw_deinit();
        return -ENODEV;
      }

    /* Armino bandgap_init() (components_init.c:250), ported verbatim in
     * hal_port/hal_port_bandgap.c.  Order is upstream's: components_init()
     * runs driver_early_init() -> pm_init() -> bandgap_init() ->
     * random_init(), so this sits between the TRNG init above (the
     * driver_early_init step) and the srand() below (the random_init step).
     * pm_init() is empty in this profile -- CONFIG_DEEP_PS is not set -- so
     * nothing is skipped between them.
     *
     * It reads the per-die VDDDIG bandgap trim out of OTP and programs it,
     * which this port has never done: sys_drv_set_bgcalm() was a log-only
     * stub until 2026-09-09, so the trim kept its reset value and the PHY's
     * own bandgap writes went nowhere either.  Now that the accessor is real,
     * running this makes the analog reference start from its calibrated
     * value instead of from reset -- otherwise the PHY would be adjusting a
     * trim whose baseline is wrong.
     *
     * Never fails in a way that should stop bring-up: both OTP-read failure
     * paths fall through to the default_bandgap branch and it returns BK_OK
     * regardless, so the return value is logged rather than acted on. */

    ret = hp_bandgap_init();
    syslog(LOG_INFO, "[BK7258-WIFI] runtime: bandgap trim ret=%d\n", ret);

    /* Armino random_init() (components_init.c:251, one line: srand(bk_rand())).
     * Without it rand() behaves as srand(1) per C99 7.20.2.2, so every boot
     * produces the identical sequence -- and wpa_supplicant draws the SNonce
     * and every other nonce straight from it (os_none.c:266 os_get_random(),
     * :283 os_random()).  Authority runs this after bandgap_init(); nothing
     * between the two consumes rand(), and bandgap_init() will slot in ahead
     * of this call when it is imported.
     *
     * Placement is load-bearing in a way it is not on FreeRTOS: NuttX keeps the
     * PRNG seed in task_info_s (lib_srand.c:250-259 ta_randint*), which hangs
     * off task_group_s.tg_info (sched.h:611) -- per task group, shared by the
     * pthreads in it, NOT global.  bk7258_wifi_osal_thread_create() uses
     * pthread_create(), so the vendor core/kmsg/wpas threads join this task's
     * group and observe this seed.  Seeding from a different task (a kthread,
     * or a later NSH invocation) would leave those threads on the default
     * seed while appearing to succeed. */

    srand((unsigned int)bk_rand());

    ret = bk_adc_driver_init();
    if (ret != BK_OK)
      {
        syslog(LOG_ERR, "[BK7258-WIFI] runtime: SARADC init failed=%d\n", ret);
        bk7258_wifi_hw_deinit();
        return -ENODEV;
      }
  }

  /* Armino components_init() creates the sensor cache after driver_init()
   * and before PHY users run.  This port owns SARADC initialization here, so
   * keep the same ordering locally: libbk_phy.a's manual calibration code
   * updates temperature/voltage through the sensor setters during its first
   * calibration pass and must not see an uninitialized cache. */
  ret = bk_sensor_init();
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] runtime: sensor init failed=%d\n", ret);
      bk7258_wifi_hw_deinit();
      return -ENODEV;
    }

