JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_lower.c
  ret = bk_event_init();
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] runtime: event init failed=%d\n", ret);
      bk7258_wifi_hw_deinit();
      return -ENODEV;
    }

  /* LPO source alignment, MOVED HERE 2026-09-01 (was after
   * bk7258_wifi_lower_register, i.e. after bk_wifi_init had already run).
   *
   * The authoritative build carries CONFIG_DEFAULT_LPO_SRC=2 (= ROSC) as a
   * BUILD-TIME setting, so on that board R41.lpo_config is already ROSC
   * before any vendor library executes.  Our port programmed it late, which
   * means libbk_phy.a (bk_phy/rf_adapter_init below) and libwifi.a
   * (bk_wifi_init) both observed the reset default first and the final value
   * only afterwards.  That matters because the MM_START_REQ handler is
   * documented to call _bk_pm_lpo_src_get() twice and compare the answers:
   * a source that changes underneath the library is a divergence we control.
   *
   * Placed before bk_phy_adapter_init so BOTH archives see one stable value
   * for their whole lifetime. */
  {
    /* AON PMU R41.lpo_config (bits[1:0]): 0=DIVD 1=X32K 2=ROSC. */
    uint32_t r41 = getreg32(BK7258_AON_PMU_R41);

    r41 = (r41 & ~BK7258_AON_PMU_R41_LPO_CONFIG_MASK) | UINT32_C(2);
    putreg32(r41, BK7258_AON_PMU_R41);
    syslog(LOG_INFO,
           "[BK7258-WIFI] pmq: lpo_src set to ROSC (pre-adapter) r41=0x%08lx\n",
           (unsigned long)getreg32(BK7258_AON_PMU_R41));
  }

  /* AON RTC counter start.
   *
   * Armino runs bk_aon_rtc_driver_init() from driver_init()
   * (cp/middleware/driver/common/driver.c:380), i.e. after bk_adc_driver_init()
   * and well before app_wifi_init().  This port took over driver_init()'s
   * responsibilities above, so the SARADC-then-AON-RTC relative order is
   * preserved -- but the call is placed HERE rather than next to
   * bk_adc_driver_init() on purpose.
   *
   * The AON RTC counter is clocked from AON PMU R41.lpo_config.  The authority
   * board carries CONFIG_DEFAULT_LPO_SRC=2 as a BUILD-TIME setting, so R41
   * already selects ROSC before any authority code runs and its AON RTC init
   * always observes the final clock source.  This port programs R41 at runtime,
   * in the block immediately above.  Starting the counter before that write
   * would enable it against a source that is still about to change, which is a
   * plausible way to reproduce the very stalled-counter symptom this import
   * fixes.
   *
   * This is still far ahead of every consumer.  bk_wifi_init() below reaches
   * rwnx_intf_init() -> rwnxl_sleep(), which polls a MAC status bit and
   * compares two 64-bit tick reads to build a 200 ms timeout; with a counter
   * that never advances, that comparison keeps the loop on its fast path and
   * the timeout is never evaluated.
   */

  {
    /* TEMPORARY DIAGNOSTIC -- REMOVE once the AON RTC tick question is settled.
     * Reads the counter twice before and twice after init, so one boot log
     * answers both "was the tick frozen before?" and "does it advance after?".
     * To remove: delete this comment, the four uint64_t locals, the two
     * up_udelay() calls and the two "[aonrtc]" syslog lines, keeping the
     * bk_aon_rtc_driver_init() call and its error check.
     *
     * Reading before init is safe and non-mutating: the authority
     * aon_rtc_hal_get_counter_val() recomputes hal->hw from the unit id on
     * entry, so the still-zeroed s_aon_rtc[] state addresses the real counter
     * registers, and the accessor only reads them.
     */

    uint64_t pre_a;
    uint64_t pre_b;
    uint64_t post_a;
    uint64_t post_b;

    pre_a = bk_aon_rtc_get_current_tick(AON_RTC_ID_1);
    up_udelay(2000);
    pre_b = bk_aon_rtc_get_current_tick(AON_RTC_ID_1);

    /* 2 ms of a 32 kHz LPO is ~64 ticks, so the verdict is unambiguous:
     * two equal pre-init values mean the counter was never started. */

    syslog(LOG_INFO, "[aonrtc] pre-init tick=%llu -> %llu\n",
           (unsigned long long)pre_a, (unsigned long long)pre_b);

    ret = bk_aon_rtc_driver_init();
    if (ret != BK_OK)
      {
        syslog(LOG_ERR, "[BK7258-WIFI] runtime: AON RTC init failed=%d\n", ret);
        bk7258_wifi_hw_deinit();
        return -ENODEV;
      }

    post_a = bk_aon_rtc_get_current_tick(AON_RTC_ID_1);
    up_udelay(2000);
    post_b = bk_aon_rtc_get_current_tick(AON_RTC_ID_1);

    syslog(LOG_INFO, "[aonrtc] post-init tick=%llu -> %llu\n",
           (unsigned long long)post_a, (unsigned long long)post_b);
  }

  syslog(LOG_INFO, "[BK7258-WIFI] runtime: bind adapters\n");
  bk_phy_adapter_init();
  ret = bk_rf_adapter_init();
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] runtime: RF adapter validation failed=%d\n",
             ret);
      bk7258_wifi_hw_deinit();
      return -ENODEV;
    }

  /* vnd_cal overlay: Armino runs it after app_phy_init/bk_rf_adapter_init
   * and before app_wifi_init (phy/SARADC/analog access path ready, tables
   * in place before calibration_init consumes them inside bk_wifi_init).
   * Calling it before this point crashed inside the closed-source
   * vnd_cal_set_epa_config (float logging path with uninitialized
   * infrastructure). */
  {
    extern void vnd_cal_overlay(void);

    vnd_cal_overlay();
    syslog(LOG_INFO, "[BK7258-WIFI] vnd_cal overlay applied\n");
  }
  /* power_clk_rf_init is deliberately NOT called here.
   *
   * The authoritative bk7258 build never executes it: driver.c:271 guards
   * the call with CONFIG_POWER_CLOCK_RF, Kconfig defaults it to n, and the
   * reference iperf build carries no such define (sdkconfig.cmake:429 sets
   * it empty).  ROSC calibration, temp-detect enable and the R41 bit24
   * rosc->wifi route therefore never run on the authoritative board, so
   * running them here manufactured a divergence rather than closing one.
   * See investigation/bk7258-bk-only/init-sequence-comparison.md.
   */

  syslog(LOG_INFO, "[BK7258-WIFI] runtime: bk_wifi_init begin\n");
  ret = bk_wifi_init(&(wifi_init_config_t)WIFI_DEFAULT_INIT_CONFIG());
  if (ret != BK_OK)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] runtime: bk_wifi_init failed=%d\n",
             ret);
      bk_event_deinit();
      bk7258_wifi_hw_deinit();
      return -ENODEV;
    }
  syslog(LOG_INFO, "[BK7258-WIFI] runtime: bk_wifi_init complete\n");
#endif

  ret = bk7258_wifi_lower_init(&g_bk7258_wifi);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_wifi_lower_register(&g_bk7258_wifi);
  if (ret < 0)
    {
      syslog(LOG_ERR, "[BK7258-WIFI] lower register failed=%d\n", ret);
    }
#if CONFIG_BK7258_WIFI_VENDOR_RUNTIME
  /* Clock-root fix (see investigation external-analysis-and-clock-root-cause
   * .md §3): rwnx_env+0xa8 (the 80 MHz mode code feeding
   * rwnxl_covert_cpu_freq -> rwnxl_compute_cpu_freq -> crm_clk_set) is never
   * initialized by the pinned archive, so crm_clk_set ran with clk_config
   * row 0, leaving 0x49000000=0 and the NXMAC core without a functional
   * clock.  Both functions are global exports of libwifi.a; seeding the
   * vote slot and applying row 1 restores the authoritative clock state. */
  /* The LPO-source write that used to sit here has MOVED to just before
   * bk_phy_adapter_init (see the comment there).  Programming it at this
   * point was too late to be an alignment: bk_wifi_init had already run, so
   * libbk_phy.a and libwifi.a observed the reset default for their whole
   * init and the intended value only afterwards -- and the old comment's
   * claim "before any libwifi clock/scan path runs" was simply false. */
  /* Diagnostic experiment writes REMOVED (2026-09-01).  Three writes lived
   * here -- 0x49100054=0x10000, 0x49100010=0xDEAD0000 and
   * 0x49850010=0x108 -- and they poisoned every register table quoted as
   * parity evidence: any NXWIN/RSTWIN reading of those addresses reflected
   * our own write rather than hardware state.  The 0x49100054 write also
   * mis-attributed the bit5 divergence to ourselves, when in fact it
   * CLEARS bit5 and the closed library sets it during scan.  No
   * authoritative code writes these addresses from the host side; keep the
   * init path free of experiment writes so register evidence stays valid.
   *
   * Fix v2 seed ROLLED BACK (2026-09-01): the authoritative-board WPROBE
   * comparison proved the archive leaves rwnx_env+0xa8 at its native 0
   * through MM_START and the CRM stays on clk_config row 0
   * (0x49000000=0 / 0x49850008=0x108 / 0x49850010=0x108) while the NXMAC
   * FSM is fully active (0x49100504=0x40000000).  Seeding a8=1 and calling
   * crm_clk_set(1) here diverged from the authoritative behavior (it also
   * wrote 0x49850010=0x3108, bits[13:12] force) and is not needed: row 0
   * IS the working configuration on both platforms. */
  bk7258_wifi_parity_banner();
#endif

  /* CPU frequency alignment, tail half (2026-09-02).
   *
   * The authority votes the CPU TWICE, and the order matters:
   *   bk_init.c:267  vote(PM_DEV_ID_DEFAULT, PM_CPU_FRQ_120M)
   *   bk_init.c:292  app_wifi_init() -> bk_netif_init() + bk_wifi_init()
   *   bk_init.c:372  #if CONFIG_CPU_DEFAULT_FREQ_60M
   *   bk_init.c:373      vote(PM_DEV_ID_DEFAULT, PM_CPU_FRQ_60M)
   *
   * So the authority also brings Wi-Fi up at 120M and only downshifts to 60M
   * afterwards; the working reference log's `clkdiv=0x00100037` (ckdiv_core=7,
   * 60M) is the state AFTER init, not during it.  The vote at the head of this
   * function therefore stays at 120M -- replacing it with 60M would run
   * calibration and bk_wifi_init at a frequency the authority never uses.
   *
   * CONFIG_CPU_DEFAULT_FREQ_60M is 1 in the authority build
   * (build/bk7258/iperf/bk7258/config/sdkconfig.h:231), and PM_CPU_FRQ_60M is
   * 1 (pm.h:347), reusing PM_DEV_ID_DEFAULT == 41 from the 120M vote above so
   * this replaces that module's vote rather than adding a second voter. */

  {
    extern bk_err_t bk_pm_module_vote_cpu_freq(uint32_t dev, uint32_t frq);
    extern void hp_dvfs_log_state(const char *tag);
    bk_err_t freq60_ret;

    freq60_ret = bk_pm_module_vote_cpu_freq(41 /* PM_DEV_ID_DEFAULT */,
                                           1 /* PM_CPU_FRQ_60M */);
    hp_dvfs_log_state("post-init-60m");
    syslog(LOG_INFO,
           "[BK7258-WIFI] init done: cpu_freq vote 60M ret=%d\n",
           (int)freq60_ret);
  }

  return ret;
}

int bk7258_wifi_initialize(void)
{
  int expected = BK7258_WIFI_INIT_NOT_STARTED;
  int ret;

  if (!atomic_compare_exchange_strong_explicit(
        &g_bk7258_wifi_init_state, &expected,
        BK7258_WIFI_INIT_INITIALIZING, memory_order_acq_rel,
        memory_order_acquire))
    {
      if (expected == BK7258_WIFI_INIT_READY)
        {
          return OK;
        }

      if (expected == BK7258_WIFI_INIT_FAILED)
        {
          return g_bk7258_wifi_init_result;
        }

      return -EINPROGRESS;
    }

  ret = bk7258_wifi_initialize_once();
  g_bk7258_wifi_init_result = ret;
  atomic_store_explicit(&g_bk7258_wifi_init_state,
                        ret < 0 ? BK7258_WIFI_INIT_FAILED :
                                  BK7258_WIFI_INIT_READY,
                        memory_order_release);
  return ret;
}
